# Загадочные числа древнего мудреца

<p align="center">
<b>Загадочные числа древнего мудреца</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

В древнем свитке, найденном археологами в пещере математического мудреца, была описана последовательность чисел, обладающих особыми магическими свойствами. Согласно легенде, числа, которые не делятся ни на *2*, ни на *3*, ни на *5*, обладают силой открывать секретные двери в хранилище знаний.

Профессор Иванов, изучающий этот свиток, решил проверить эту легенду. Для этого ему необходимо найти *n*-е по порядку натуральное число, которое не делится ни на *2*, ни на *3*, ни на *5*.

Помогите профессору найти это число!

**Входные данные**

В единственной строке входного файла содержится одно целое число *n* *(1≤n≤10⁴)* — порядковый номер числа, которое нужно найти.

**Выходные данные**

Выведите одно целое число — *n*-е по порядку натуральное число, которое не делится ни на *2*, ни на *3*, ни на *5*.

**Пример**

| **Входные данные** |
|--------------------|
| 1                  |

| **Выходные данные** |
|---------------------|
| 1                   |

| **Входные данные** |
|--------------------|
| 2                  |

| **Выходные данные** |
|---------------------|
| 7                   |

| **Входные данные** |
|--------------------|
| 3                  |

| **Выходные данные** |
|---------------------|
| 11                  |

Все тесты пройдены, задача сдана:
```py
n = int(input())
for i in range(1, 2*3*5*n):
    if i % 2 != 0 and i % 3 != 0 and i % 5 != 0:
        n -= 1

    if n == 0:
        print(i)
        break
```
