# Ира и томаты - 2

<p align="center">
<b>Ира и томаты - 2</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

Ира ходила в магазин *N* дней. В первый день она купила *Q* томатов, во второй день – *(Q+1)* томат, в третий день – *(Q+2)* томатов, в *k*−ый день – *(Q+k−1)* томат. Таким образом, каждый день Ирина покупала на один томат больше, чем в прошлый.

Вычислите, сколько всего томатов купила Ира за эти *N* дней.

**Входные данные**

В первой строке дано целое положительное число *N* *(N≤100)*. Во второй строке дано целое положительное число *Q* *(Q≤100)*.

**Выходные данные**

Выведите ответ на задачу.

**Пример**

| **Входные данные** |
|--------------------|
| 3                  |
| 1                  |

| **Выходные данные** |
|---------------------|
| 6                   |

| **Входные данные** |
|--------------------|
| 5                  |
| 2                  |

| **Выходные данные** |
|---------------------|
| 20                  |


Все тесты пройдены, задача сдана:
```py
n = int(input())
q = int(input())
s = 0
for i in range(n):
    s += q + i

print(s)
```
