# Нечетное количество

<p align="center">
<b>Нечетное количество</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

Вам дан массив *a1,a2,…,an*. Выведите количество чисел, которые встречаются нечетное количество раз.

**Входные данные**

В единственной строке друг за другом вводятся числа *a1,a2,…,an* *(1≤n≤1000, 1≤a<sub>i</sub>≤1000)*.

**Выходные данные**

Выведите единственное целое число — ответ на задачу.

**Пример**

| **Входные данные** |
|--------------------|
| 1 2 3 3 2 2        |

| **Выходные данные** |
|---------------------|
| 2                   |

| **Входные данные** |
|--------------------|
| 1 2 3 1 2 3 1 2    |

| **Выходные данные** |
|---------------------|
| 2                   |


Все тесты пройдены, задача сдана:
```py
a = list(map(int, input().split()))
cnt_odd = set()
for num in a:
    if num in cnt_odd:
        cnt_odd.remove(num)
    else:
        cnt_odd.add(num)

print(len(cnt_odd))
```
