# Красивая строка

<p align="center">
<b>Красивая строка</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

Саша очень любит котиков. У Саши есть строка *s*. Саша хочет между каждой парой подряд идущих символов в строке *s* вставить котика. Котик задается последовательностю символов "^_^" (без кавычек). Помогите Саше осуществить мечту.

**Входные данные**

В первой строке вводится строка *s* *(1≤∣s∣≤10⁶)*.

**Выходные данные**

Выведите строку с котиками.

**Пример**

| **Входные данные** |
|--------------------|
| ilovecats          |

| **Выходные данные**                       |
|-------------------------------------------|
| i^\_^l^\_^o^\_^v^\_^e^\_^c^\_^a^\_^t^\_^s |


Все тесты пройдены, задача сдана:
```py
s = list(input())
s_new = []
for i in s:
    s_new.append(i)
    if i != ' ':
        s_new.append("^_^")

s_new.pop(len(s_new) - 1)
print(''.join(s_new))
```
