# Треугольник

<p align="center">
<b>Треугольник</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

Дано целое число *n* и символ *s*. Нарисуйте в выводе прямоугольный треугольник со сторонами размером *n* (подробнее в примерах).

**Входные данные**

В первой строке дано целое число *n*, *(1≤n≤20)*. Во второй строке дан символ *s*. Гарантируется, что во второй строке будет один символ.

**Выходные данные**

На выходе ожидается нарисованный символами *s* прямоугольный треугольник со сторонами размером *n*.

**Пример**

| **Входные данные** |
|--------------------|
| 3                  |
| 0                  |

| **Выходные данные** |
|---------------------|
| 0                   |
| 00                  |
| 000                 |

| **Входные данные** |
|--------------------|
| 5                  |
| X                  |

| **Выходные данные** |
|---------------------|
| X                   |
| XX                  |
| XXX                 |
| XXXX                |
| XXXXX               |

**Примечание**

Для того, чтобы получить символ из ввода, можно воспользоваться конструкцией

*s=input()*

Все тесты пройдены, задача сдана:
```py
n = int(input())
s = input()
for i in range(n):
    for j in range(i+1):
        print(s, end='', sep='')
    print()
```
