# Число слогов

<p align="center">
<b>Число слогов</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

Вам дано слово *s*. Посчитайте количество гласных букв в этом слове. Гласными буквами мы считаем буквы «A», «E», «I», «O», «U» (конечно, как большие, так и маленькие)

**Входные данные**

В единственной строке вводится слово *s*, состоящее не более чем из *25* символов — латинских букв.

**Выходные данные**

Выведите единственное целое число — ответ на задачу.

**Пример**

| **Входные данные** |
|--------------------|
| Ananas             |

| **Выходные данные** |
|---------------------|
| 3                   |


Все тесты пройдены, задача сдана:
```py
s = input()
cnt = 0
for i in s:
    if i.upper() in "AEIOU":
        cnt += 1

print(cnt)
```
