# Спряталась

<p align="center">
<b>Спряталась</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

Существует ли в данном тексте *s* заглавная буква, которая не стоит первой?

При решении этой задачи воспользуйтесь флагом. 

**Входные данные**

В единственной строке вводится текст *s*, состоящий из не более чем *20* символов. Символами могут быть как буквы, так и знаки препинания.

**Выходные данные**

Выведите «YES» или «NO» — ответ на задачу.

**Пример**

| **Входные данные**  |
|---------------------|
| What does it mean?  |

| **Выходные данные** |
|---------------------|
| NO                  |

| **Входные данные** |
|--------------------|
| Buy IT!            |

| **Выходные данные** |
|---------------------|
| YES                 |


Все тесты пройдены, задача сдана:
```py
s = input()
appears = False
for i in range(1, len(s)):
    if s[i].isupper():
        appears = True
        break

if appears:
    print("YES")
else:
    print("NO")
```
