# Последовательность

<p align="center">
<b>Последовательность</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

Вам вводятся по одному в строке числа: *a1,a2,…*. Они должны быть все положительные, но вы точно знаете, что среди них есть как минимум одно отрицательное.

Ваша задача — забить тревогу, сообщив сумму всех положительных чисел до первого встречного отрицательного. Используйте для этого цикл *while*.

**Входные данные**

Друг за другом в разных строках вводятся числа *a1,a2,…*. Количество чисел неизвестно, но в тестах их не больше *20*, каждое из них по модулю не превосходит *100*, но при этом ни одно из них не равно нулю. Гарантируется, что среди вводимых чисел встречается как минимум одно отрицательное число.

**Выходные данные**

Пока очередное число не окажется отрицательным, прибавляйте к общей сумме вводимые числа. Как только вы встретите первое отрицательное число, завершайте программу, при этом выведите сумму чисел до первого отрицательного, не включая это отрицательное в сумму.

**Пример**

| **Входные данные** |
|--------------------|
| 4                  |
| 2                  |
| -1                 |
| 5                  |

| **Выходные данные** |
|---------------------|
| 6                   |


Все тесты пройдены, задача сдана:
```py
s = 0
while True:
    a = int(input())
    if a < 0:
        break
    s += a

print(s)
```
