# Сумма счастливых чисел

<p align="center">
<b>Сумма счастливых чисел</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

Число *x* назовем счастливым, если *x* делится на семь.

Посчитайте сумму счастливых чисел в массиве *a1,a2,…,an*.

**Входные данные**

В единственной строке друг за другом вводятся числа *a1,a2,…,an* *(1≤n≤10, 1≤a<sub>i</sub>≤100)*.

**Выходные данные**

Выведите единственное целое число — сумму всех счастливых чисел.

**Пример**

| **Входные данные** |
|--------------------|
| 7 8 9              |

| **Выходные данные** |
|---------------------|
| 7                   |


Все тесты пройдены, задача сдана:
```py
a = list(map(int, input().split()))
s = 0
for i in a:
    if i % 7 == 0:
        s += i

print(s)
```
