# Многоэтажка

<p align="center">
<b>Многоэтажка</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

Назовем этаж неспокойным, если там есть две соседние квартиры, в которых включен свет.

В доме *n* этажей и на каждом этаже *m* квартир. Посчитайте количество неспокойных этажей в этом доме.

**Входные данные**

В первой строке вводятся числа *n* и *m* — количество этажей и квартир на каждом этаже *(1≤n,m≤10)*.

В следующих *n* строках вводятся описания этажей — строки длины *m*, состоящие из нулей и единиц. Единица обозначает, что в соответствующей квартире горит свет, а ноль — что не горит.

**Выходные данные**

Выведите единственное целое число — ответ на задачу.

**Пример**

| **Входные данные** |
|--------------------|
| 4 4                |
| 0110               |
| 1100               |
| 0011               |
| 0101               |

| **Выходные данные** |
|---------------------|
| 3                   |


Все тесты пройдены, задача сдана:
```py
n, m = map(int, input().split())
cnt_floor = 0
for i in range(n):
    s = input()
    for j in range(1, m):
        if s[j - 1] == '1' and s[j] == '1':
            cnt_floor += 1
            break
            
print(cnt_floor)
```
