# Большая коллекция

Мечта Васи сбылась. Его наконец перевели в отдел разработки. Васе дали задание разбирать данные с [HH](https://github.com/hhru/api/blob/master/docs/vacancies.md) для того, чтобы их можно было передать в отдел аналитики. С HH данные приходят в следующем формате:

На вход поступает название [CSV файла](https://ru.wikipedia.org/wiki/CSV) (Гарантируется что оно корректное, и уже находится в директории запуска). А возвращает список заголовков CSV и список списков, где каждый вложенный список содержит все поля вакансии (подробнее в Формате вывода).

Программа должна отсекать те строки, поля которых заполнены меньше, чем наполовину. Например, если в таблице есть 6 заголовков, и есть строки, в которых данные заполнены меньше чем у 3 заголовков, то такие строки должны отсеиваться.

Требования:
- Требуемые данные сохраните в 2 переменные.
- Форматирование осуществлять не нужно.
- Переменные выводите через print().


**Формат ввода**

В csv-файле используется следующая структура:

```
name,premium,employer_name,salary_from,salary_to,area_name
Программист,FALSE,
Инженер,FALSE,Сервисный центр ЭКСПЕРТ,30000,60000,Санкт-Петербург
```

[Скачать пример файла](example_vacancies.zip)

**Формат вывода**

```
['name', 'premium', 'employer_name', 'salary_from', 'salary_to', 'area_name']
[['Инженер', 'FALSE', 'Сервисный центр ЭКСПЕРТ', '30000', '60000', 'Санкт-Петербург']]
```

**Примечания**

В этой и последующих задачах, где используется открытие CSV-файлов через стандартную функцию open(), необходимо позаботиться о кодировке.

В этих файлах используется UTF c BOM.

|                         |                        |
|:------------------------|:-----------------------|
| **Ограничение времени** | **1 секунда**          |
| **Ограничение памяти**  | **64.0 Мб**            |
| **Ввод**                | **название CSV файла** |
| **Вывод**               | **стандартный вывод**  |


Все тесты пройдены, задача сдана:
```py
import csv

file_name = input()
lines = []
with open(file_name, 'r', encoding='utf-8-sig', newline='') as file:
    csv_reader = csv.reader(file)
    headers = next(csv_reader)
    for line in csv_reader:
        filled = []
        for value in line:
            value = value.strip()
            filled.append(value)
        if (len(filled) - filled.count('')) * 2 >= len(headers):
            lines.append(line)

print(headers)
print(lines)
```
