# Коля и счет

<p align="center">
<b>Коля и счет</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

У Коли сейчас *k* рублей на накопительном счету в некотором Берляндском банке. У банка необычная система поощрения Коли — она зависит от четности года.

Если текущий год четный, то Коле добавляется пять рублей, а если нечетный — остаток от деления текущей суммы на одиннадцать. Эта "добавка" кладется на тот же счет.

Задача начинается в *1991* году, то есть первое поощрение банка будет по взятию остатка от деления, а дальше начнется чередование.

Посчитайте, через сколько лет у Васи будет не меньше *a* рублей. 

**Входные данные**

В первой строке вводится целое число *k* *(1≤k≤5000)*.

Во второй строке вводится целое число *a* *(1≤a≤5000)*.

Гарантируется, что *a>k*.

**Выходные данные**

Выведите единственное целое число — ответ на задачу.

**Пример**

| **Входные данные** |
|--------------------|
| 3                  |
| 11                 |

| **Выходные данные** |
|---------------------|
| 2                   |

| **Входные данные** |
|--------------------|
| 3                  |
| 8                  |

| **Выходные данные** |
|---------------------|
| 2                   |


Все тесты пройдены, задача сдана:
```py
k = int(input())
a = int(input())
years = 1991
while k < a:
    if years % 2 == 0:
        k += 5
    else:
        k += k % 11
        
    years += 1

print(years - 1991)
```
