# Считаем сумму

<p align="center">
<b>Считаем сумму</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

Как-то раз программисту Васе стало очень скучно и он начал думать как это исправить. Первым делом он побежал к своему другу Вове, чтобы спросить у него, как он справляется со скукой. Вова не стал хранить в секрете свой способ борьбы с таким недугом и начал рассказывать самый действенный алгоритм, который только знал.

Первым делом нужно выбрать достаточно большое натуральное число nn, притом чем больше, тем интересней получится времяпровождение. Затем нужно посчитать сумму вида *1+2+3+...+n* в своей голове и сказать вслух ответ.

Вася конечно же поблагодарил своего друга за то, что он с ним поделился своим рецептом, но для себя он решил, что это слишком скучное занятие, и лучше он запрограммирует такое развлечение!

**Входные данные**

На вход дано единственное целое число *n* *(1≤n≤50)*.

**Выходные данные**

На выходе ожидается строка вида *1+2+3+...+n=s*, где *n* – число из входных данных, а *s* – значение получившейся суммы. Ставить пробелы не нужно.

**Пример**

| **Входные данные** |
|--------------------|
| 5                  |

| **Выходные данные** |
|---------------------|
| 1+2+3+4+5=15        |

| **Входные данные** |
|--------------------|
| 3                  |

| **Выходные данные** |
|---------------------|
| 1+2+3=6             |


Все тесты пройдены, задача сдана:
```py
n = int(input())
s = 0
for i in range(1, n + 1):
    s += i
    if i < n:
        print(i, end='+')

print(i, end='=')
print(s)
```
