# Отрицательные числа

<p align="center">
<b>Отрицательные числа</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

Вам дан массив *a1,a2,…,an*. Пусть наименьшее число в этом массиве равно *x*. Посчитайте сумму чисел, которые не больше ∣*x*∣.

**Входные данные**

В единственной строке друг за другом вводятся числа *a1,a2,…,an* *(1≤n≤10, −100≤a<sub>i</sub>≤100)*.

**Выходные данные**

Выведите единственное целое число — ответ на задачу.

**Пример**

| **Входные данные** |
|--------------------|
| 1 -3 100           |

| **Выходные данные** |
|---------------------|
| -2                  |


Все тесты пройдены, задача сдана:
```py
a = list(map(int, input().split()))
x = abs(min(a))
s = 0
for i in a:
    if i <= x:
        s += i
        
print(s)
```
