# Общее количество нечетных

<p align="center">
<b>Общее количество нечетных</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

Вам даны два массива чисел *a1,a2,…,an* и *b1,b2,…,bn*. Найдите количество чисел, которые встречаются в обоих массивах хотя бы один раз и нечетное количество раз хотя бы в одном из двух наборов чисел.

**Входные данные**

В первой строке друг за другом вводятся числа *a1,a2,…,an* *(1≤n≤10, 1≤a<sub>i</sub>≤10)*, а во второй строке в таком же формате числа *b1,b2,…,bn* *(1≤b<sub>i</sub>≤10)*

**Выходные данные**

Выведите единственное целое число — ответ на задачу.

**Пример**

| **Входные данные** |
|--------------------|
| 1 1 1 2            |
| 2 2 2 2            |

| **Выходные данные** |
|---------------------|
| 1                   |


Все тесты пройдены, задача сдана:
```py
def num_odd(list_num, set_odd):
    for num in list_num:
        if num in set_odd:
            set_odd.remove(num)
        else:
            set_odd.add(num)

a = list(map(int, input().split()))
b = list(map(int, input().split()))
a_odd = set()
b_odd = set()
num_odd(a, a_odd)
num_odd(b, b_odd)

a_all = set(a)
b_all = set(b)
com_num = a_all & b_all
result = com_num & (a_odd | b_odd)

print(len(result))
```
