# Утка

<p align="center">
<b>Утка</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

"Уткой" мы назовем человека с именем *t*.

Василий Васильевич работает охранником, и ему нужно пропустить *n* товарищей с именами *s1,s2,…,sn*. Если вдруг какой-то из товарищей оказывается уткой, то Василий Васильевич тут же смеется.

Посчитайте, сколько раз Василий Васильевич рассмеется.

**Входные данные**

В первой строке вводится число *n* — количество товарищей *(1≤n≤10)*.

Во второй строке вводится имя *t* из заглавных и строчных латинских букв — "утка" *(1≤∣t∣≤10)*.

В следующих *n* строках вводятся имена товарищей, одно за другим, каждое длиной не более *10* и тоже из заглавных и строчных латинских букв.

**Выходные данные**

Выведите единственное целое число — сколько раз Василий Васильевич рассмеется.

**Пример**

| **Входные данные** |
|--------------------|
| 5                  |
| Duck               |
| Chuck              |
| Duck               |
| Jonny              |
| Ann                |
| Duck               |

| **Выходные данные** |
|---------------------|
| 2                   |


Все тесты пройдены, задача сдана:
```py
n = int(input())
t = input()
c = 0
for i in range(n):
    s = input()
    if s == t:
        c += 1

print(c)
```
