# Где "Я"?

<p align="center">
<b>Где "Я"?</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

Вам будет дано предложение, записаное в одной строке. Ваша задача — вывести номер первого слева слова «I».

**Входные данные**

В единственной строке вводится предложение *s*, состоящее исключительно из латинских букв и пробелов. Длина *s* не превосходит *100*.

**Выходные данные**

Выведите единственное целое число — номер первого слова, равного «I» в *s*. Если такого слова нет, выведите *−1*.

**Пример**

| **Входные данные** |
|--------------------|
| Here I am          |

| **Выходные данные** |
|---------------------|
| 2                   |


Все тесты пройдены, задача сдана:
```py
s = input().split()
cnt = -1
for i in range(len(s)):
    if s[i] == 'I':
        cnt = i + 1
        break

print(cnt)
```
