# Рынок

<p align="center">
<b>Рынок</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

Саша торгует на бирже Юкоинами. Известно, сколько он стоил на протяжении *n* дней: *p1,p2,…,pn*.

Саша называет день странным, если это третий день или более поздний, и цена на Юкоин в этот день строго выше суммы цен на Юкоин в предыдущие два дня.

Сообщите Саше, сколько странных дней было за всю историю и какая максимальная цена Юкоина достигалась в эти дни. Если странных дней не было, выведите два нуля.

**Входные данные**

В единственной строке вводятся числа *p1,p2,…,pn* *(1≤n≤30, 1≤p<sub>i</sub>≤1000)*.

**Выходные данные**

Выведите два целых числа. Первое — количество странных дней, а второе — максимальная стоимость Юкоина во время странных дней.

**Пример**

| **Входные данные** |
|--------------------|
| 10 1 2 4 6         |

| **Выходные данные** |
|---------------------|
| 1 4                 |


Все тесты пройдены, задача сдана:
```py
p = list(map(int, input().split()))
cnt = 0
p_max = 0
for i in range(2, len(p)):
    if p[i - 2] + p[i - 1] < p[i]:
        cnt += 1
        if p_max < p[i]:
            p_max = p[i]
        
print(cnt, p_max)
```
