# Маленькая буква

<p align="center">
<b>Маленькая буква</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

Вам дана строка *s* и буква *t*. Найдите самую правую такую букву, которая не больше буквы *t* (используйте для этого операторы сравнения).

Выведите саму букву, которая меньше *t* и при этом самая правая. Если же такой буквы не существует, выведите *−1*.

**Входные данные**

В первой строке вводится строка *s*, состоящая из заглавных латинских букв *(1≤∣s∣≤50)*.

Во второй строке вводится заглавная латинская буква *t*.

**Выходные данные**

Выведите символ или число *−1* — ответ на задачу.

**Пример**

| **Входные данные** |
|--------------------|
| BARASS             |
| C                  |

| **Выходные данные** |
|---------------------|
| A                   |


Все тесты пройдены, задача сдана:
```py
s = input()
t = input()
ans = -1
for i in range(1, len(s) + 1):
    if s[-i] <= t:
        ans = s[-i]
        break
        
print(ans)
```
