# Большие данные

<p align="center">
<b>Большие данные</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

Учёные-историки решили оцифровать «Книгу Страшного суда» - первую земельную перепись в Англии, проведённую Вильгельмом I Завоевателем после её завоевания. После оцифровки, в числе прочего, было решено составить списки людей, проживающих в том или ином городе. Проблема заключается в том, что в Книге содержится очень много записей, о том, где живёт тот или иной человек. Историки не осилили такое количество данных, и просят вас помочь им.

**Входные данные**

В первой строке дано целое положительное число *N* – количество записей *(1≤N≤1000)*. Далее в отдельных строках даются *N* записей вида 'Имя человека:город проживания'. Имена и названия городов состоят из одного слова, содержащего заглавные и строчные латинские буквы. Длина имён и названий городов не превосходит *60* символов. В записях может быть любое количество людей с одинаковыми именами, которые могут жить как в разных городах, так и в одном городе. Такие записи считаются различными, т.е. нужно вывести по имени на каждую из них.

**Выходные данные**

Выведите данные о людях, проживающих в том или ином городе. Сначала выведите число *M* - количество городов. Затем для каждого города выведите его название и число *M<sub>i</sub>* - количество человек, проживающих в городе, разделённые пробелом. Затем в отдельных строках выведите *M<sub>i</sub>* строк - имена жителей города. И данные о городах, и данные о жителях нужно вывести в лексикографическом порядке.

**Пример**

| **Входные данные** |
|--------------------|
| 5                  |
| William:London     |
| Harold:Hastings    |
| Odo:London         |
| Godwin:Essex       |
| William:Hastings   |

| **Выходные данные** |
|---------------------|
| 3                   |
| Essex 1             |
| Godwin              |
| Hastings 2          |
| Harold              |
| William             |
| London 2            |
| Odo                 |
| William             |


Все тесты пройдены, задача сдана:
```py
n = int(input())
city_data = dict()

for _ in range(n):
    name, city = input().split(':')
    if city not in city_data:
        city_data[city] = []
    city_data[city].append(name)
    
print(len(city_data))

sorted_cities = sorted(city_data.keys())
for city in sorted_cities:
    residents = sorted(city_data[city])
    print(city + ' ' + str(len(residents)))
    for resident in residents:
        print(resident)
```
