# Тетрис

<p align="center">
<b>Тетрис</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

Вам дан массив *a1,a2,…,an*. Пусть наименьший элемент этого массива равен *x*. Вычтите из каждого элемента массива *x*.

**Входные данные**

В единственной строке друг за другом вводятся числа *a1,a2,…,an* *(1≤n≤10, 0≤a<sub>i</sub>≤100)*.

**Выходные данные**

Выведите результат преобразования массива.

**Пример**

| **Входные данные** |
|--------------------|
| 2 4 5 5 2 4        |

| **Выходные данные** |
|---------------------|
| 0 2 3 3 0 2         |


Все тесты пройдены, задача сдана:
```py
a = list(map(int, input().split()))
x = min(a)
for i in range(len(a)):
    a[i] -= x

print(*a)
```
