# Яркие слова

<p align="center">
<b>Яркие слова</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

Слово назовем ярким, если оно состоит исключительно из заглавных букв.

Вам будет дано предложение, записаное в одной строке. Ваша задача — вывести количество ярких слов в этом предложении.

**Входные данные**

В единственной строке вводится предложение *s*, состоящее исключительно из латинских букв и пробелов. Длина *s* не превосходит *100*.

**Выходные данные**

Выведите единственное целое число — количество ярких слов.

**Пример**

| **Входные данные** |
|--------------------|
| BRIGHT or not      |

| **Выходные данные** |
|---------------------|
| 1                   |


Все тесты пройдены, задача сдана:
```py
s = input().split()
cnt = 0
for i in range(len(s)):
    if s[i].isupper():
        cnt += 1

print(cnt)
```
