# Волшебные тройки

<p align="center">
<b>Волшебные тройки</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

В древнем королевстве Алгоритмии существует легенда о волшебных тройках чисел. Согласно преданию, король Алгоритмии должен найти все возможные тройки натуральных чисел, сумма которых равна заданному числу *n*, чтобы открыть магическую сокровищницу.

Формально, необходимо найти количество различных троек натуральных чисел *(a,b,c)* таких, что *a+b+c=n*.

Помогите королю решить эту задачу!

**Входные данные**

В единственной строке входного файла содержится одно целое число *n* *(3≤n≤100)* — число, для которого нужно найти количество троек.

**Выходные данные**

Выведите одно целое число — количество различных троек натуральных чисел *(a,b,c)* таких, что *a+b+c=n*.

**Пример**

| **Входные данные** |
|--------------------|
| 4                  |

| **Выходные данные** |
|---------------------|
| 3                   |

| **Входные данные** |
|--------------------|
| 10                 |

| **Выходные данные** |
|---------------------|
| 36                  |


**Примечание**

В первом тесте существуют следующие тройки: *(1,1,2)*, *(1,2,1)*, *(2,1,1)*.

Все тесты пройдены, задача сдана:
```py
n = int(input())
c = 0
for i in range(1, n):
    for j in range(1, n):
        for k in range(1, n):
            if i + j + k == n:
                c += 1
                break

print(c)
```
