# Путешествие робота

<p align="center">
<b>Путешествие робота</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

В исследовательской лаборатории «Технокрафт» разработали нового робота для исследования неизвестных территорий. Робот перемещается по плоскости с декартовой системой координат, где каждая клетка соответствует паре целых чисел *(x,y)*.

Инженеры тестируют робота и отправляют ему последовательность команд в виде строки ss, состоящей из символов 'L', 'R', 'U', 'D', где:
- 'L' — переместиться на одну клетку влево (координата *x* уменьшается на *1*);
- 'R' — переместиться на одну клетку вправо (координата *x* увеличивается на *1*);
- 'U' — переместиться на одну клетку вверх (координата *y* увеличивается на *1*);
- 'D' — переместиться на одну клетку вниз (координата *y* уменьшается на *1*). 

Изначально робот находится в клетке с координатами *(0,0)*.

Для оценки эффективности работы робота инженерам необходимо знать, сколько различных клеток посетит робот в процессе выполнения всех команд, включая начальную клетку.

**Входные данные**

В единственной строке входных данных содержится непустая строка *s* *(1≤∣s∣≤10⁵)*, состоящая только из символов 'L', 'R', 'U', 'D' — последовательность команд для робота.

**Выходные данные**

Выведите одно целое число — количество различных клеток, которые посетит робот, включая начальную клетку.

**Пример**

| **Входные данные** |
|--------------------|
| LRUD               |

| **Выходные данные** |
|---------------------|
| 3                   |

| **Входные данные** |
|--------------------|
| LLRR               |

| **Выходные данные** |
|---------------------|
| 3                   |

| **Входные данные** |
|--------------------|
| LRLR               |

| **Выходные данные** |
|---------------------|
| 2                   |


Все тесты пройдены, задача сдана:
```py
s = input()
x, y = 0, 0
visited = set()
visited.add((x, y))

for move in s:
    if move == 'L':
        x -= 1
    elif move == 'R':
        x += 1
    elif move == 'U':
        y += 1
    elif move == 'D':
        y -= 1
    visited.add((x, y))

print(len(visited))
```
