# Форматирование данных

После того, как Вася успешно справился с вводом данных, его не хотят отпускать. Ему дали новое поручение: красиво вывести данные, чтобы их можно было использовать как карточку профессии.

Доработайте код из предыдущей задачи и оформите данные в соответствии с форматом вывода:
- Вычислить средний оклад в диапазоне и округлить вниз до целого числа
- Выполнить склонение существительных год и рубль, для соответствия числительному
- Типы данных, как в прошлой задаче, указывать не нужно


**Формат ввода**

```
Введите название вакансии: Программист
Введите описание вакансии: Хорошие знания C#, JavaScript(Опыт работы. Синтаксис. ООП)
Введите город для вакансии: Екатеринбург
Введите требуемый опыт работы (лет): 1
Введите нижнюю границу оклада вакансии: 40000
Введите верхнюю границу оклада вакансии: 350000
Нужен свободный график (да / нет):
Является ли данная вакансия премиум-вакансией (да / нет):
```

Здесь и далее для удобства чтения формат ввода будет показан в совмещенном виде, что печатает программа и что вводит пользователь.

**Формат вывода**

```
Программист
Описание: Хорошие знания C#, JavaScript(Опыт работы. Синтаксис. ООП)
Город: Екатеринбург
Требуемый опыт работы: 1 год
Средний оклад: 195000 рублей
Свободный график: да
Премиум-вакансия: нет
```

|                         |                       |
|:------------------------|:----------------------|
| **Ограничение времени** | **1 секунда**         |
| **Ограничение памяти**  | **64.0 Мб**           |
| **Ввод**                | **стандартный ввод**  |
| **Вывод**               | **стандартный вывод** |


Все тесты пройдены, задача сдана:
```py
vacancy = input('Введите название вакансии: ')
description = input('Введите описание вакансии: ')
city = input('Введите город для вакансии: ')
experience = int(input('Введите требуемый опыт работы (лет): '))
min_sal = int(input('Введите нижнюю границу оклада вакансии: '))
max_sal = int(input('Введите верхнюю границу оклада вакансии: '))
free_schedule = input("Нужен свободный график (да / нет): ")
premium = input("Является ли данная вакансия премиум-вакансией (да / нет): ")

def declension(value: int, one, few, many) -> str:
    if 11 <= value % 100 <= 14:
        return many
    elif value % 10 == 1:
        return one
    elif 2 <= value % 10 <= 4:
        return few
    else:
        return many

avg_sal = (min_sal + max_sal) // 2

print(f'{vacancy}')
print(f'Описание: {description}')
print(f'Город: {city}')
print(f"Требуемый опыт работы: {experience} {declension(experience, 'год', 'года', 'лет')}")
print(f"Средний оклад: {avg_sal} {declension(avg_sal, 'рубль', 'рубля', 'рублей')}")
print(f'Свободный график: {free_schedule.lower()}')
print(f'Премиум-вакансия: {premium.lower()}')
```
