# Динамический максимум

<p align="center">
<b>Динамический максимум</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

Вася и Петя решили поиграть в игру. Вася будет исполнять запросы Пети по очереди.

У Васи изначально есть пустое множество чисел. Запросы Пети представляют собой одно число, которое Вася должен добавлять в свое множество. Ответом Васи на запрос является наибольшее число, среди находящихся в его множестве.

Вася решил не придумывать сложных решений и отвечать на запросы по-простому: накапливать все числа в своем множестве, и на каждом запросе Пети искать максимум заново. Но примерно на двадцатом числе Вася стал отвечать на запросы Пети слишком долго.

Сможете ли вы отвечать на такие запросы быстрее?

**Входные данные**

На вход дана последовательность чисел *a<sub>i</sub>* *(1≤a<sub>i</sub>≤10000)*. Каждое число в последовательности находится в новой строке. Последовательность заканчивается числом *−1* (само число *−1* не является запросом Пети). Гарантируется, что длина последовательности запросов Пети не превосходит *20000*.

**Выходные данные**

На каждый запрос Пети выведите ответ Васи. Каждый ответ выводите в отдельной строке.

**Пример**

| **Входные данные** |
|--------------------|
| 1                  |
| 2                  |
| 3                  |
| 4                  |
| -1                 |

| **Выходные данные** |
|---------------------|
| 1                   |
| 2                   |
| 3                   |
| 4                   |

| **Входные данные** |
|--------------------|
| 4                  |
| 3                  |
| 2                  |
| 1                  |
| -1                 |

| **Выходные данные** |
|---------------------|
| 4                   |
| 4                   |
| 4                   |
| 4                   |

Все тесты пройдены, задача сдана:
```py
a_i = 0
a_max = -1
while True:
    a_i = int(input())
    if a_i == -1:
        break
    if a_i > a_max:
        a_max = a_i
    print(a_max)
```
