# Диалоговая система

<p align="center">
<b>Диалоговая система</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

У вас есть счетчик *a=0*.

Пользователь друг за другом вводит неотрицательные числа *k1,k2,…*. Строго положительные числа обозначают следующую операцию: нужно к счетчику *a* прибавить некоторое число.

Ваша задача — прервать выполнение операций, как только счетчик *a* превысит значение *32*. Однако пользователь может прервать выполнение программы вручную — для этого он вводит число *0*. Гарантируется, что только последнее вводимое пользователем число всегда равно нулю.

В качестве подтверждения, выведите при прерывании, сколько операций было выполнено до того, как вы прервались. Последнюю операцию (прибавление или ввод числа ноль) также учитывайте при подсчете. Таким образом, вы должны вывести целое и строго положительное число. 

**Входные данные**

По одному в строке вводится не более *32* чисел: *k1,k2,…*. Только последнее введенное число равно нулю, остальные могут быть любыми положительными.

**Выходные данные**

Выведите единственное целое число — количество выполненных команд до прерывания.

**Пример**

| **Входные данные** |
|--------------------|
| 1                  |
| 2                  |
| 0                  |

| **Выходные данные** |
|---------------------|
| 3                   |

| **Входные данные** |
|--------------------|
| 32                 |
| 1                  |
| 0                  |

| **Выходные данные** |
|---------------------|
| 2                   |


Все тесты пройдены, задача сдана:
```py
a = 0
cnt = 0
while a <= 32:
    k = int(input())
    cnt += 1
    if k == 0:
        break
    else:
        a += k
    
print(cnt)
```
