# Факториал

<p align="center">
<b>Факториал</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

Вам дано число *N*, нужно посчитать его факториал. Факториалом числа *N* называется произведение всех натуральных чисел от *1* до *N*.

*N!=1⋅2⋅..⋅N*.

**Входные данные**

В первой строке дано целое положительное число *N*, не превосходящее *100*.

**Выходные данные**

Выведите ответ на задачу.

**Пример**

| **Входные данные** |
|--------------------|
| 3                  |

| **Выходные данные** |
|---------------------|
| 6                   |

| **Входные данные** |
|--------------------|
| 4                  |

| **Выходные данные** |
|---------------------|
| 24                  |

**Примечание**

Вычисление факториалов для примеров:

*3!=1⋅2⋅3*,

*4!=1⋅2⋅3⋅4*. 

Все тесты пройдены, задача сдана:
```py
n = int(input())
f = 1
for i in range(1, n+1):
    f *= i
    
print(f)
```
