# Разворот последовательности

<p align="center">
<b>Разворот последовательности</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

В этой задаче вам нужно реализовать разворот последовательности с помощью рекурсии. Пользоваться циклами запрещено. Так же запрещено пользоваться списками и другими структурами данных, если они вам известны.

**Входные данные**

На вход дается последовательность чисел *a<sub>i</sub>* *(1≤a<sub>i</sub>≤10)*. Каждое число находится в отдельной строке. Последовательность кончается числом *−1*.

Длина последовательности не превосходит *20*.

**Выходные данные**

Выведете данную последовательность в обратном порядке. Каждое число также должно находиться в отдельной строке. (*−1* выводить не нужно)

**Пример**

| **Входные данные** |
|--------------------|
| 3                  |
| 10                 |
| 2                  |
| -1                 |

| **Выходные данные** |
|---------------------|
| 2                   |
| 10                  |
| 3                   |


Все тесты пройдены, задача сдана:
```py
def reverse_sequence():
    num = int(input())
    if num == -1:
        return
    reverse_sequence()
    print(num)

reverse_sequence()
```
