# Запрещенные слова

<p align="center">
<b>Запрещенные слова</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

Известно, что в Берляндии запрещены следующие слова: «code», «problem», «solution», «ok», «wa». Запрещены и эти же слова, записанные в других регистрах (например, полностью заглавными буквами), но не запрещены словоформы, сокращения и прочие производные от этих слов.

Вам прислали текст *t*. Посчитайте запрещённых слов в нем.

**Входные данные**

В единственной строке вводится текст *t*, состоящий не более чем из *70* символов — латинских букв и пробелов.

**Выходные данные**

Выведите единственное целое число — ответ на задачу.

**Пример**

| **Входные данные**     |
|------------------------|
| Where to Code OK to do |

| **Выходные данные** |
|---------------------|
| 2                   |


Все тесты пройдены, задача сдана:
```py
t = input().split()
forbidden = ["code","problem","solution","ok","wa"]
cnt = 0
for i in t:
    if i.lower() in forbidden:
        cnt += 1

print(cnt)
```
