# Делится на k?

<p align="center">
<b>Делится на k?</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

Дана последовательность целых чисел и число *k*. Для каждого префикса последовательности выведите количество чисел на этом префиксе, которые делятся на *k*.

**Входные данные**

В первой строке дано целое число *k* *(1≤k≤1000)*. Во второй строке дано целое число *n*  — длина последовательности *(1≤n≤20000)*. В третьей строке дано nn целых чисел *a<sub>i</sub>* *(1≤a<sub>i</sub>≤20000)*, записанных через пробел  — сама последовательность.

**Выходные данные**

Для каждого префикса выведите количество чисел, делящихся на *k* без остатка. Каждое число выводите в отдельной строке.

**Пример**

| **Входные данные** |
|--------------------|
| 2                  |
| 6                  |
| 1 2 3 4 5 6        |

| **Выходные данные** |
|---------------------|
| 0                   |
| 1                   |
| 1                   |
| 2                   |
| 2                   |
| 3                   |

| **Входные данные** |
|--------------------|
| 2                  |
| 6                  |
| 2 4 6 8 10 12      |

| **Выходные данные** |
|---------------------|
| 1                   |
| 2                   |
| 3                   |
| 4                   |
| 5                   |
| 6                   |

Все тесты пройдены, задача сдана:
```py
k = int(input())
n = int(input())
a = list(map(int, input().split()))
cnt = 0
for i in a:
    if i % k == 0:
        cnt += 1
    print(cnt)
```
