# Первый делитель

<p align="center">
<b>Первый делитель</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

Вам дано натуральное число *n*. Нужно найти минимальное число, не равное единице, которое делит *n*.

Напомним, что делитель *b* является делителем *a*, когда *a* делится нацело на *b* без остатка.

**Входные данные**

В единственной строке входных данных вводится целое число *n* *(2≤n≤10⁵)*.

**Выходные данные**

Выведите минимальный делитель *n*, не равный *1*.

**Пример**

| **Входные данные** |
|--------------------|
| 6                  |

| **Выходные данные** |
|---------------------|
| 2                   |

| **Входные данные** |
|--------------------|
| 9                  |

| **Выходные данные** |
|---------------------|
| 3                   |


Все тесты пройдены, задача сдана:
```py
n = int(input())
for i in range(2, n+1):
    if n % i == 0:
        print(i)
        break
```
