# Тортик

<p align="center">
<b>Тортик</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

Дан квадратный тортик *n×n*, на котором расположено *n* клубничек в заданной ориентиации. Вася хочет разрезать его на *n* равных кусочков *1×n*, причем разрезы он будет делать сверху вниз (кусочки будут вытянутые вверх).

Скажите, правда ли, что на каждом кусочке будет по меньшей мере одна клубничка?

**Входные данные**

В первой строке вводится число *n* — размер тортика *(1≤n≤10)*.

В следующих *n* строках вводится описание тортика — строки длины *n*, состоящие из точек и заглавных латинских букв «C», обозначающих клубничку. Гарантируется, что на тортике ровно *n* клубничек.

**Выходные данные**

Выведите «YES» или «NO» — ответ на задачу.

**Пример**

| **Входные данные** |
|--------------------|
| 3                  |
| ..C                |
| .C.                |
| C..                |

| **Выходные данные** |
|---------------------|
| YES                 |

| **Входные данные** |
|--------------------|
| 3                  |
| C..                |
| C..                |
| C..                |

| **Выходные данные** |
|---------------------|
| NO                  |


Все тесты пройдены, задача сдана:
```py
n = int(input())
index = -1
ans = "YES"
for i in range(n):
    s = input()
    for j in range(n):
        if s[j] == 'C':
            if j == index:
                ans = "NO"
            index = j
            break

print(ans)
```
