# Неделимое отдаем Паше

<p align="center">
<b>Неделимое отдаем Паше</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

У трех друзей *n* апельсинов, у каждого из них свое количество долек.

Три друга с каждым апельсином по очереди поступают так: они каждому дают равное и максимально возможное число долек, а неделимый отстаток от каждого апельсина отдают Паше. Таким образом, Паше от каждого апельсина достается количество долек, равное остатку от деления исходного числа долек на *3*.

Посчитайте, сколько всего Паша получит долек от всех апельсинов.

**Входные данные**

В единственной строке друг за другом вводятся числа *a1,a2,…,an* — количество долек в апельсинах *(1≤n≤10, 1≤a<sub>i</sub>≤10)*.

**Выходные данные**

Выведите единственное целое число — количество долек, которое достанется Паше.

**Пример**

| **Входные данные** |
|--------------------|
| 3 6 2 2            |

| **Выходные данные** |
|---------------------|
| 4                   |


Все тесты пройдены, задача сдана:
```py
a = list(map(int, input().split()))
s = 0
for i in a:
    s += i % 3

print(s)
```
