# Странные операции

<p align="center">
<b>Странные операции</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

Дана последовательность из чисел *a<sub>i</sub>*. Вам нужно применять странную операцию к этому числу. Если число четное, выведите его же. Иначе, выведите произведение всех чисел *k*, *1≤k<*a<sub>i</sub>**.

**Входные данные**

В первой строке записано целое число *n*, *(1≤n≤10)*. Затем, в следующих nn строках даны числа *a<sub>i</sub>* *(1≤a<sub>i</sub>≤10)*.

**Выходные данные**

Для каждого числа в последовательности выведите значение странной операции для него в отдельной строке.

**Пример**

| **Входные данные** |
|--------------------|
| 5                  |
| 1                  |
| 2                  |
| 3                  |
| 4                  |
| 5                  |

| **Выходные данные** |
|---------------------|
| 1                   |
| 2                   |
| 2                   |
| 4                   |
| 24                  |


Все тесты пройдены, задача сдана:
```py
n = int(input())
for i in range(n):
    a_i = int(input())
    if a_i % 2 == 0:
        print(a_i)
        continue
    p = 1
    for j in range(1, a_i):
        p *= j

    print(p)
```
