# Мясник

<p align="center">
<b>Мясник</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

У Мясника есть строка *s*, числа *l* и *r* и тесак (это такой большой нож).

Мясник сначала отрубает от строки первые *l* букв и выбрасывает их. Затем он отрубает от оставшейся строки последние *r* букв и их тоже выбрасывает. В результате остается строка длины *s−l−r*.

Очень вкусное блюдо получается, когда в итоговой строке есть буква «F». Сообщите, есть ли она там.

**Входные данные**

В первой строке вводится последовательность символов *s*, состоящая из заглавных латинских букв. Длина *s* не превосходит *20*.

Во второй строке вводится целое число *l*. В третьей строке вводится целое число *r*. Гарантируется, что *0≤l,r* и *l+r<n*.

**Выходные данные**

Выведите «YES», если «F» есть в оставшейся строке, и «NO» иначе.

**Пример**

| **Входные данные** |
|--------------------|
| AFK                |
| 1                  |
| 1                  |

| **Выходные данные** |
|---------------------|
| YES                 |

| **Входные данные** |
|--------------------|
| GOOSE              |
| 0                  |
| 3                  |

| **Выходные данные** |
|---------------------|
| NO                  |


Все тесты пройдены, задача сдана:
```py
s = input()
l = int(input())
r = int(input())
s_new = ''
for i in range(l, len(s) - r):
    s_new += s[i]
    
if s_new.count('F') > 0:
    print("YES")
else:
    print("NO")
```
