# Количество прямоугольников

<p align="center">
<b>Количество прямоугольников</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

Вам дано клетчатое поле размером *n×m* клеток. Требуется определить, сколько различных прямоугольников можно нарисовать на этом поле, при условии, что клетки можно закрашивать только целиком.

**Входные данные**

В первой строке входных данных вводится целое число *n* — размер первой стороны прямоугольника *(1≤n≤50)*.

Во второй строке входных данных вводится целое число *m* — размер второй стороны прямоугольника *(1≤m≤50)*.

**Выходные данные**

Выведите количество различных прямоугольников.

**Пример**

| **Входные данные** |
|--------------------|
| 2                  |
| 2                  |

| **Выходные данные** |
|---------------------|
| 9                   |


**Примечание**

В первом примере существует *9* различных прямоугольников: один квадрат *2×2*, *2* прямоугольника *1×2*, *2* прямоугольника *2×1* и *4* квадрата *1×1*.

Все тесты пройдены, задача сдана:
```py
n = int(input())
m = int(input())
c = 0
for i in range(n):
    for j in range(m):
        c += (n - i) * (m - j)

print(c)
```
