# Делится на оба

<p align="center">
<b>Делится на оба</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

На вход даны два числа *a* и *b*. Выведите наименьшее число, делящееся и на *a* и на *b*.

**Входные данные**

В первой строке дано целое число *a*. Во второй строке дано целое число *b*. *(1≤a,b≤10)*.

**Выходные данные**

В единственной строке выведите одно целое число – ответ на задачу.

**Пример**

| **Входные данные** |
|--------------------|
| 2                  |
| 5                  |

| **Выходные данные** |
|---------------------|
| 10                  |

| **Входные данные** |
|--------------------|
| 2                  |
| 4                  |

| **Выходные данные** |
|---------------------|
| 4                   |


Все тесты пройдены, задача сдана:
```py
a = int(input())
b = int(input())
for i in range(2, a * b + 1):
    if i % a == 0 and i % b == 0:
        print(i)
        break
```
