# Так много условий

<p align="center">
<b>Так много условий</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

Дана последовательность из *N* чисел. Нужно сказать, какие из следующих условий выполняются:
- в последоваельности есть число больше числа *M*;
- в последовательности есть чётное число;
- в последовательности есть три соседних числа *a,b,c* такие, что *a<b<c*.

**Входные данные**

В первой строке через пробел вводятся числа *N* и *M* *(3≤N≤1000, 1≤M≤100)*. Затем в отдельных строках вводятся *N* чисел *A<sub>i</sub>* *(1≤A<sub>i</sub>≤100)*.

**Выходные данные**

Для каждого условия в том порядке, в котором они приведены в условии, в отдельной строке выведите «YES» или «NO»(без кавычек) в зависимости от того, выполняется оно или нет.

**Пример**

| **Входные данные** |
|--------------------|
| 10 16              |
| 5                  |
| 3                  |
| 7                  |
| 113                |
| 27                 |
| 19                 |
| 51                 |
| 35                 |
| 19                 |
| 73                 |

| **Выходные данные** |
|---------------------|
| YES                 |
| NO                  |
| YES                 |


Все тесты пройдены, задача сдана:
```py
nm = input()
for i in range(len(nm)):
    if nm[i] == ' ':
        break

n = int(nm[:i])
m = int(nm[i+1:])
condition_1 = "NO"
condition_2 = "NO"
condition_3 = "NO"
a_1 = 0
a_2 = 0
a_3 = 0
for i in range(n):
    a_1 = a_2
    a_2 = a_3
    a_3 = int(input())
    if a_3 > m:
        condition_1 = "YES"
        
    if a_3 % 2 == 0:
        condition_2 = "YES"
    
    if i > 1 and a_1 < a_2 and a_2 < a_3:
        condition_3 = "YES"

print(condition_1)
print(condition_2)
print(condition_3)
```
