# Хорошая строка

<p align="center">
<b>Хорошая строка</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

Вам вводится строка, состоящая исключительно из латинских букв «A», «B» и «C».

Ваша задача — удалять символы с начала строки, пока первым символом не станет буква «A». Как только это произойдет, выведите оставшуюся строку. Если окажется, что строка опустела, а до буквы «A» этот процесс так и не добрался, ничего не выводите (выведите пустую строку).

**Входные данные**

В единственной строке вводится строка длиной не более *30*.

**Выходные данные**

Выведите строку — оставшуюся строку после этих операций.

**Пример**

| **Входные данные** |
|--------------------|
| BAC                |

| **Выходные данные** |
|---------------------|
| AC                  |

| **Входные данные** |
|--------------------|
| B                  |

| **Выходные данные** |
|---------------------|
|                     |


Все тесты пройдены, задача сдана:
```py
s = input()
while not s.startswith('A') and len(s) > 0:
    s = s[1:]

print(s)
```
