# Блэкджек

<p align="center">
<b>Блэкджек</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

Бендер играет в блэкджек — это такая игра, где каждой карте сопоставлена некоторая стоимость: стоимость карт с цифрами равна этой самой цифре, карты «J», «Q», «K» стоят *10* очков, а «A» в этой задаче стоит *11* очков.

Ради интереса, в этой партии в колоде лежат исключительно *13* карт: от двойки до десятки, валет, дама, король и туз.

Бендер узнал, как лежат карты в колоде. Его задача — взять несколько карт с начала, чтобы сумма очков была не больше *21*, но при этом была максимально возможной.

Сообщите только одно число — сколько карт нужно взять Бендеру из колоды, чтобы сумма очков была максимально возможной, но не превосходила *21*.

**Входные данные**

В триннадцати строках вводится некоторая перестановка карт: значения «2», «3», «4», «5», «6», «7», «8», «9», «10», «J», «Q», «K», «A» — числа, валет, дама, король и туз.

**Выходные данные**

Выведите единственное целое число — сколько карт следует взять Бендеру.

**Пример**

| **Входные данные** |
|--------------------|
| 2                  |
| Q                  |
| A                  |
| 8                  |
| 7                  |
| 3                  |
| K                  |
| 9                  |
| J                  |
| 5                  |
| 4                  |
| 10                 |
| 6                  |

| **Выходные данные** |
|---------------------|
| 2                   |


Все тесты пройдены, задача сдана:
```py
s = 0
cnt = -1
while s <= 21:
    card = input()
    if card == 'J' or card == 'Q' or card == 'K':
        card = 10
    elif card == 'A':
        card = 11
    else:
        card = int(card)
        
    s += card
    cnt += 1
    
print(cnt)
```
