# Изменения в строке

<p align="center">
<b>Изменения в строке</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

Вам вводится *s* строка и *q* запросов на замену одного символа строки на другой.

**Входные данные**

В первой строке вводится строка *s* *(1≤∣s∣≤10⁵)*.

Во второй строке вводится число *q* *(1≤q≤10⁵)*.

В следующих *q* строках вводятся число и буква — индекс, по которому требуется заменить строку (не меньше *1* и не больше ∣*s*∣) и буква, которую надо поставить по заданному индексу.

**Выходные данные**

Выведите строку после проделанных операций.

**Пример**

| **Входные данные** |
|--------------------|
| lol                |
| 3                  |
| 2 e                |
| 1 k                |
| 3 k                |

| **Выходные данные** |
|---------------------|
| kek                 |


Все тесты пройдены, задача сдана:
```py
s = list(input())
q = int(input())
for i in range(q):
    n, ch = input().split()
    s[int(n) - 1] = ch

print(''.join(s))
```
