# Числа, делящиеся на 5

<p align="center">
<b>Числа, делящиеся на 5</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

Даны целые положительные числа *A* и *B* *(1≤A<B≤1000)*. Выведите все числа от *A* до *B*, которые делятся на *5*.

**Входные данные**

В первой строке дано целое положительное число *A*, во второй – *B*.

**Выходные данные**

Выведите все числа от *A* до *B*, делящиеся на *5*, в одну строку через пробел.

**Пример**

| **Входные данные** |
|--------------------|
| 1                  |
| 10                 |

| **Выходные данные** |
|---------------------|
| 5 10                |

| **Входные данные** |
|--------------------|
| 31                 |
| 52                 |

| **Выходные данные** |
|---------------------|
| 35 40 45 50         |


Все тесты пройдены, задача сдана:
```py
a = int(input())
b = int(input())
for i in range(a, b+1):
    if i % 5 == 0:
        print(i, end=' ')
```
