# Марина и яблоки - 2

<p align="center">
<b>Марина и яблоки - 2</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

У Марины есть *M* друзей и *N* корзинок с яблоками. В *i*−ой корзинке лежит *A<sub>i</sub>* яблок. Марина решила поделить яблоки между своими друзьями следующим образом: яблоки из *i*−ой корзинки делятся между друзьями поровну, а если яблоки остаются в корзине после дележа, то Марина отдаст оставшиеся яблоки из *i*−ой корзины соседу. Это будет повторяться, пока все корзины не опустеют.

В первой строке выведите количество яблок, которое получит каждый из друзей, а во второй – количество яблок соседа.

**Входные данные**

В первой строке дано целое положительное число *M* *(M≤20)*. Во второй – целое положительное число *N* *(N≤100)*. В каждой из следующих *N* строк дано по одному целому числу *A<sub>i</sub>* *(0≤A<sub>i</sub>≤100)*.

**Выходные данные**

Выведите ответ на задачу.

**Пример**

| **Входные данные** |
|--------------------|
| 3                  |
| 3                  |
| 5                  |
| 4                  |
| 3                  |

| **Выходные данные** |
|---------------------|
| 3                   |
| 3                   |

| **Входные данные** |
|--------------------|
| 2                  |
| 3                  |
| 10                 |
| 10                 |
| 0                  |

| **Выходные данные** |
|---------------------|
| 10                  |
| 0                   |


Все тесты пройдены, задача сдана:
```py
m = int(input())
n = int(input())
s_frends = 0
s_neighbour = 0
for i in range(n):
    a = int(input())
    s_frends += a // m
    s_neighbour += a % m

print(s_frends)
print(s_neighbour)
```
