# Получение данных

Вася устроился на новую работу в крутую компанию программистом, однако, на тестовый период его попросили помочь в отделе кадров, по вводу вакансий с информацией о профессиях.

В отделе кадров заполняют необходимую информацию в следующем интерфейсе:
```
Введите название вакансии: Программист
Введите описание вакансии: Хорошие знания C#, JavaScript(Опыт работы. Синтаксис. ООП)
Введите город для вакансии: Екатеринбург
Введите требуемый опыт работы (лет): 1
Введите нижнюю границу оклада вакансии: 40000
Введите верхнюю границу оклада вакансии: 350000
Нужен свободный график (да / нет): да
Является ли данная вакансия премиум-вакансией (да / нет): нет
```

Необходимо чтобы ввод осуществлялся после соответствующей фразы, например: `'Введите название вакансии: '`. Т.е. программа сначала печатает фразу, после чего ждет ввод значения от пользователя, после ввода значения от пользователя, программа печатает следующий запрос и так далее, до конца работы программы.

Вася решил сделать первую версию программы, ее задача подготовить данные для сохранения, а именно, получить все значения о вакансии преобразовать их к необходимым типам данных и (для проверки) вывести их с соответствующими подписями на экран.

Необходимо именно ОПРЕДЕЛИТЬ тип переменной, не надо выводить заранее предопределённое значение! Не забывайте, что в вывод попадают не только введенные от пользователя данные, но и те запросы, которые пишет сама программа.

В формате вывода ниже для удобства пропущены запросы от самой программы (сами запросы, которые выводит программа, написаны выше в интерфейсе отдела кадров) и показаны только преобразованные введенные данные от пользователя.

**Формат ввода**

```
Программист
Хорошие знания C#, JavaScript(Опыт работы. Синтаксис. ООП)
Екатеринбург
1
40000
350000
да
нет
```

**Формат вывода**

```
Программист (str)
Хорошие знания C#, JavaScript(Опыт работы. Синтаксис. ООП) (str)
Екатеринбург (str)
1 (int)
40000 (int)
350000 (int)
True (bool)
False (bool)
```

|                         |                       |
|:------------------------|:----------------------|
| **Ограничение времени** | **1 секунда**         |
| **Ограничение памяти**  | **64.0 Мб**           |
| **Ввод**                | **стандартный ввод**  |
| **Вывод**               | **стандартный вывод** |


Все тесты пройдены, задача сдана:
```py
vacation = input('Введите название вакансии: ')
discription = input('Введите описание вакансии: ')
city = input('Введите город для вакансии: ')
experience = int(input('Введите требуемый опыт работы (лет): '))
min_sal = int(input('Введите нижнюю границу оклада вакансии: '))
max_sal = int(input('Введите верхнюю границу оклада вакансии: '))
free_schedule = input("Нужен свободный график (да / нет): ")
free_schedule = free_schedule.lower() == "да"
premium = input("Является ли данная вакансия премиум-вакансией (да / нет): ")
premium = premium.lower() == "да"

data = [vacation, discription, city, experience, min_sal, max_sal, free_schedule, premium]

for value in data:
    print(f"{value} ({type(value).__name__})")
```
