# Сумма цифр

<p align="center">
<b>Сумма цифр</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

Напишите функцию, которая посчитает сумму цифр. В качестве аргумента она должна принимать число, сумму цифр которого следует посчитать. Затем решите следующую задачу.

Дан массив *a1,a2,…,an*. Посчитайте сумму цифр всех нечетных чисел.

**Входные данные**

В единственной строке вводятся числа *a1,a2,…,an* *(1≤n≤20,1≤a<sub>i</sub>≤200)*.

**Выходные данные**

Выведите только одно целое число — сумму цифр всех нечетных чисел.

**Пример**

| **Входные данные** |
|--------------------|
| 1 3 2 5 1 2 19     |

| **Выходные данные** |
|---------------------|
| 20                  |


Все тесты пройдены, задача сдана:
```py
def sum_dig(num):
    s = 0
    while num > 0:
        s += num % 10
        num = num // 10
    return s

a = list(map(int, input().split()))
s = 0
for a_i in a:
    if a_i % 2 != 0:
        s += sum_dig(a_i)

print(s)
```
