# Трибоначчи

<p align="center">
<b>Трибоначчи</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

Юра учится в физико-математической школе. Сейчас по программе в его классе проходят рекуррентные выражения. Эта тема оказалась слишком сложной для Юры, поэтому он попросил дополнительное задание на дом, чтобы постараться поглубже разобраться с этими выражениями. Учительница одобрила его намерения и дала задание выписать первые *20* чисел **трибоначчи**.

Числа трибоначчи задаются рекурентной формулой:

<p align="center"><i>if n≤1 then: ϕ(n) = 1</i></p>

<p align="center"><i>if n>1 then: ϕ(n) = ϕ(n−1) + ϕ(n−2)⋅3</i></p>

Считать эти числа вручную оказалось достаточно сложно, поэтому Юра решил написать программу, которая по заданному числу *n* выводит *ϕ(n)*. Помогите ему сделать это!

**Входные данные**

На вход дано одно целое число *n*, *(0≤n≤20)*.

**Выходные данные**

Выведете единственное число: *ϕ(n)*.

**Пример**

| **Входные данные** |
|--------------------|
| 0                  |

| **Выходные данные** |
|---------------------|
| 1                   |

| **Входные данные** |
|--------------------|
| 2                  |

| **Выходные данные** |
|---------------------|
| 4                   |

| **Входные данные** |
|--------------------|
| 3                  |

| **Выходные данные** |
|---------------------|
| 7                   |


Все тесты пройдены, задача сдана:
```py
def tribonacci(n):
    if n <= 1:
        return 1
    else:
        return tribonacci(n - 1) + tribonacci(n - 2) * 3

n = int(input())
print(tribonacci(n))
```
