# Максимальная пара

<p align="center">
<b>Максимальная пара</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

Ходят слухи, что в древнем городе Аргония существует легендарный артефакт, представляющий собой последовательность *n* магических камней, каждый со своей силой. Археологи пронумеровали эти камни от *1* до *n* и измерили силу каждого камня. Сила *i*-го камня равна целому числу *a<sub>i</sub>*.

Согласно древним текстам, чтобы активировать силу артефакта, нужно выбрать два камня и объединить их энергию. Однако существуют строгие правила выбора камней:
1. Номер первого выбранного камня *i* должен быть строго меньше номера второго камня *j* (то есть *i<j*).
2. Разница между номерами камней не должна превышать некоторое число *k* (то есть *j−i≤k*).
3. Суммарная сила выбранных камней (*a<sub>i</sub>+a<sub>j</sub>*) должна быть максимально возможной при соблюдении первых двух условий. 

Помогите археологам определить, какую максимальную силу можно получить, правильно выбрав пару камней.

**Входные данные**

В первой строке входного файла содержатся два целых числа *n* и *k* *(2≤n≤1000, 1≤k≤n−1)* — количество камней и максимально допустимая разница между номерами выбираемых камней.

Во второй строке содержатся *n* целых чисел *a1,a2,…,an* *(−10⁹≤a<sub>i</sub>≤10⁹)* — силы камней.

**Выходные данные**

Выведите единственное целое число — максимально возможную суммарную силу.

**Пример**

| **Входные данные** |
|--------------------|
| 5 2                |
| 1 5 3 4 2          |

| **Выходные данные** |
|---------------------|
| 9                   |

| **Входные данные** |
|--------------------|
| 6 3                |
| -1 -2 -3 -4 -5 -6  |

| **Выходные данные** |
|---------------------|
| -3                  |

| **Входные данные** |
|--------------------|
| 7 4                |
| 10 -5 7 -8 4 2 6   |

| **Выходные данные** |
|---------------------|
| 17                  |

Все тесты пройдены, задача сдана:
```py
n, k = map(int, input().split())
a = list(map(int, input().split()))
s_max = -10**9
for j in range(1, n):
    start = max(0, j - k)
    for i in range(start, j):
        s_max = max(s_max, a[i] + a[j])

print(s_max)
```
