# Multiprocessing

Сеньор Дон Эладио дал задачу для нашего Васеньки. В их компании давно залежалась большая и медленная функция `worker_function`, которая обрабатывает списки. Она настолько большая, настолько сложная и настолько нужная, что никто из программистов не решается её оптимизировать, лишь бы не поломать. Работает, да и ладно.

И вот сейчас появилась необходимость воспользоваться этой функцией. Васеньке на вход будет поступать двумерный массив. Каждый одномерный массив в этом двумерном массиве необходимо прогнать через функцию worker_function. И все результаты сложить.

Помогите Васе найти решение этой задачи. Да так, чтобы решение было максимально эффективным по времени.

**Формат ввода**

```
[[10 4 7], [2 7 5], [7 10 5]]
```

**Формат вывода**

```
123
```

Возможно, вам в решении пригодится [multiprocessing](https://docs.python.org/3/library/multiprocessing.html)

|                         |              |
|:------------------------|:-------------|
| **Ограничение времени** | **6 секунд** |
| **Ограничение памяти**  | **512.0 Мб** |


Все тесты пройдены, задача сдана:
```py
import multiprocessing

def input_to_list(text: str):
    lists = text[1:].replace("[", "").replace("]]", "").split("], ")
    return [list(map(int, lst.split())) for lst in lists]

def main():
    array_2d = input_to_list(input())
    with multiprocessing.Pool() as p:
        result = p.map(worker_function, array_2d)
    print(sum(result))

if __name__ == "__main__":
    main()
```
