# Правильный выбор

<p align="center">
<b>Правильный выбор</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

Как вы знаете, в Берляндии есть два банка, которые дают кредиты. Первый банк удваивает каждый год сумму, которую ему надо вернуть, а второй банк — утраивает.

Саша взял в кредит *a* рублей в первом банке, а Кирилл — *b* рублей во втором банке.

Теперь через год долг Саши будет *2⋅a* рублей, через два — *4⋅a* рублей, через три — *8⋅a* рублей, и так далее. У Кирилла более печальная ситуация: его долг через год будет *3⋅b* рублей, через два — *9⋅b* рублей, через три — *27⋅b* рублей, и так далее.

Через сколько лет после того, как они положили деньги, у Кирилла долг впервые станет больше, чем у Саши? Можете считать, что Саша и Кирилл не возвращают деньги банкам.

**Входные данные**

В двух строках заданы числа *a* и *b* *(1≤a,b≤5000)*.

**Выходные данные**

Выведите единственное целое число — через сколько лет у Кирилла долг станет больше, чем у Саши. Возможно такое, что ответом будет число *0* (если изначально *b>a*).

**Пример**

| **Входные данные** |
|--------------------|
| 2                  |
| 5                  |

| **Выходные данные** |
|---------------------|
| 0                   |


Все тесты пройдены, задача сдана:
```py
a = int(input())
b = int(input())
years = 0
while a >= b:
    a *= 2
    b *= 3
    years += 1

print(years)
```
