# Поход в магазин

<p align="center">
<b>Поход в магазин</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

Влад пошёл в магазин за продуктами. Он захотел купить коробку сока и решил сравнить цены на разные варианты. Сначала он посмотрел на первую упаковку и запомнил её цену. Дальше посмотрел на вторую и обнаружил, что она стоит дороже первой. Затем увидел третью – она была дешевле второй. Запоминать разницу между вариантами было сложно, поэтому он попросил вас ему помочь. Для каждой коробки сока скажите, стоит она дешевле или дороже предыдущей. Для первой коробки ничего говорить не нужно. Гарантируется, что Влад посмотрел как минимум два варианта.

**Входные данные**

В первой строке дано целое положительное число *N* – количество коробок сока *(2≤N≤1000)*. Далее в отдельных строках даются *N* чисел – стоимость *N<sub>i</sub>* очередной коробки *(1≤N<sub>i</sub>≤1000)*.

**Выходные данные**

Для каждой коробки, кроме первой, напишите, дороже ли она предыдущей. Если да, напишите «YES», иначе «NO» (в обоих случаях без кавычек).

**Пример**

| **Входные данные** |
|--------------------|
| 3                  |
| 10                 |
| 20                 |
| 5                  |

| **Выходные данные** |
|---------------------|
| YES                 |
| NO                  |

| **Входные данные** |
|--------------------|
| 2                  |
| 10                 |
| 10                 |

| **Выходные данные** |
|---------------------|
| NO                  |


Все тесты пройдены, задача сдана:
```py
n = int(input())
price = int(input())
for i in range(n-1):
    n_i = int(input())
    if n_i <= price:
        print("NO")
    else:
        print("YES")
    price = n_i
```
