# Счетчик

<p align="center">
<b>Счетчик</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

Дана последовательность целых чисел *a<sub>i</sub>* (необязательно положительных) длины *n*. Также дан отрезок *[l;r]*. Для каждого целого числа из отрезка нужно вывести количество его вхождений в последовательность *a<sub>i</sub>*.

**Входные данные**

В первой строке даны два целых числа через пробел *l,r* *(−50≤l≤r≤50)*.

Во второй строке дано целое число *n* *(1≤n≤50)*  — количество элементов в последовательности.

В третьей строке через пробел записаны *n* целых чисел *a<sub>i</sub>* *(−50≤a<sub>i</sub>≤50)*.

**Выходные данные**

На выходе ожидается *r−l+1* строк. Каждая строка состоит из числа из отрезка и количества вхождений этого числа в последовательность. Числа разделены двоеточием и пробелом.

Формат: «*a*: *b*» (подробнее см. в примерах). Пары необходимо выводить в отсортированном порядке.

**Пример**

| **Входные данные** |
|--------------------|
| 1 3                |
| 7                  |
| 1 2 3 1 2 4 5      |

| **Выходные данные** |
|---------------------|
| 1: 2                |
| 2: 2                |
| 3: 1                |

| **Входные данные** |
|--------------------|
| -1 1               |
| 6                  |
| -1 -1 -1 0 0 1     |

| **Выходные данные** |
|---------------------|
| -1: 3               |
| 0: 2                |
| 1: 1                |

Все тесты пройдены, задача сдана:
```py
l, r = map(int, input().split())
n = int(input())
a = list(map(int, input().split()))

MIN_VAL = -50
MAX_VAL = 50
size = MAX_VAL - MIN_VAL + 1
counts = [0] * size

for num in a:
    if MIN_VAL <= num <= MAX_VAL:
        counts[num - MIN_VAL] += 1
        
for num in range(l, r + 1):
    print(str(num) + ": " + str(counts[num - MIN_VAL]))
```
