# Не делящиеся

<p align="center">
<b>Не делящиеся</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

Дан диапазон чисел от *1* до *n*. Необходимо вывести все числа из этого диапазона, которые *не делятся одновременно на 2 и на 3*. Если число делится и на *2*, и на *3*, его нужно пропустить.

**Входные данные**

Первая строка содержит целое число *n* — верхнюю границу диапазона *(1≤n≤1000)*.

**Выходные данные**

Выведите все числа от *1* до *n*, которые не делятся одновременно на *2* и на *3*. Каждое число выводите на новой строке.

**Пример**

| **Входные данные** |
|--------------------|
| 6                  |

| **Выходные данные** |
|---------------------|
| 1                   |
| 2                   |
| 3                   |
| 4                   |
| 5                   |


Все тесты пройдены, задача сдана:
```py
n = int(input())
for i in range(1, n+1):
    if i % 2 != 0 or i % 3 != 0:
        print(i)
```
