# Было ли число?

<p align="center">
<b>Было ли число?</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

Вам дана последовательность целых чисел. Необходимо для каждого числа определить, было ли оно введено ранее в этой последовательности. Если число было введено ранее, выведите «YES», иначе выведите «NO».

**Входные данные**

Первая строка содержит целое число *n* *(1≤n≤20)* — количество чисел в последовательности. Вторая строка содержит *n* целых чисел, каждое из которых находится в диапазоне от *−10* до *10* включительно.

**Выходные данные**

Выведите n строк. В каждой строке выведите YES, если соответствующее число уже встречалось в последовательности ранее, и NO в противном случае.

**Пример**

| **Входные данные** |
|--------------------|
| 5                  |
| 1 2 3 2 1          |

| **Выходные данные** |
|---------------------|
| NO                  |
| NO                  |
| NO                  |
| YES                 |
| YES                 |

| **Входные данные** |
|--------------------|
| 6                  |
| 1 4 1 4 5 3        |

| **Выходные данные** |
|---------------------|
| NO                  |
| NO                  |
| YES                 |
| YES                 |
| NO                  |
| NO                  |


Все тесты пройдены, задача сдана:
```py
n = int(input())
numbers = list(map(int, input().split()))

seen = set()
for num in numbers:
    if num in seen:
        print("YES")
    else:
        print("NO")
        seen.add(num)
```
