# Тут место только счастливым

<p align="center">
<b>Тут место только счастливым</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

У Коли есть числа *a1,a2,…,an*.

Числа, индекс которых делится на семь, он считает хорошими. А сами числа, которые делятся на семь, Коля считает счастливыми.

Числа, которые не являются ни хорошими, ни счастливыми, Коля не любит и делает отрицательными, дописывая к ним минус.

Скажите, как будет выглядеть массив, когда Коля допишет минус ко всем числам, которые не являются хорошими или счастливыми.

**Входные данные**

В единственной строке друг за другом вводятся числа *a1,a2,…,an* *(1≤n≤30, 1≤a<sub>i</sub>≤100)*.

**Выходные данные**

Выведите результат преобразования массива.

**Пример**

| **Входные данные** |
|--------------------|
| 7 7 7 5 7 7 1      |

| **Выходные данные** |
|---------------------|
| 7 7 7 -5 7 7 -1     |


Все тесты пройдены, задача сдана:
```py
a = list(map(int, input().split()))
for i in range(len(a)):
    if i % 7 != 0 and a[i] % 7 != 0:
        a[i] = -a[i]

print(*a)
```
