# Зарядка

<p align="center">
<b>Зарядка</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

На очередном уроке физкультуры учеников выстроили в шеренгу, в том числе и юного программиста Юру. Юра, конечно, любит физкультуру, но не когда она стоит первым уроком.

Пока для разминки исполнялось упражнение «повороты головы», Юра, чтобы не уснуть со скуки, во время очередного поворота головы вправо решил посчитать, скольких человек он видит в данный момент (справа от себя). Он начал свой подсчет: *1,2,3...*, пока не поймал себя на мысли, что он не видит никого дальше своего одноклассника Данила, который был выше Юры.

Хорошенько подумав над причиной такой зрительной иллюзии, он пришел к выводу, что он видит всех одноклассников справа от себя, до ближайшего не менее высокого человека. То есть, в примере с Данилом, Данил был первым одноклассником выше Юры в шеренге, поэтому Юра видел всех одноклассников между собой и Данилом.

Юре очень захотелось проверить свою теорию, поэтому он сфотографировал весь свой класс, записал показания их роста, и написал программу, которая для каждой позиции в шеренге выводит количество видимых людей с этой самой позиции. А сможете ли вы написать такую программу?

**Входные данные**

В первой строке дано единственное целое число *n*, *(1≤n≤50)*  — количество людей в шеренге. В следующей строке через пробел зписано *n* целых чисел *a<sub>i</sub>*, *(1≤a<sub>i</sub>≤50)*  — рост ученика на позиции *i*.

**Выходные данные**

Для каждой позиции *i*, *(1≤i≤n)* выведете количество людей, видимых с этой позиции. Ответ для каждой позиции должен находиться в отдельной строке.

**Пример**

| **Входные данные** |
|--------------------|
| 5                  |
| 1 2 3 4 5          |

| **Выходные данные** |
|---------------------|
| 1                   |
| 1                   |
| 1                   |
| 1                   |
| 0                   |

| **Входные данные** |
|--------------------|
| 5                  |
| 5 4 3 2 1          |

| **Выходные данные** |
|---------------------|
| 4                   |
| 3                   |
| 2                   |
| 1                   |
| 0                   |

Все тесты пройдены, задача сдана:
```py
n = int(input())
a = list(map(int, input().split()))
for i in range(n):
    cnt = 0
    for j in range(i + 1, n):
        cnt += 1
        if a[i] <= a[j]:
            break
            
    print(cnt)
```
