# Слова

<p align="center">
<b>Слова</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

Вам вводятся по одному в строке строки: *s1,s2,…*. Среди них есть как минимум одно слово, которое состоит не только из латинских букв, но и из цифр или других символов.

Ваша задача — вывести номер первого слова, которое содержит какие-либо другие символы, помимо латинских букв.

**Входные данные**

Друг за другом в разных строках вводятся строки *s1,s2,…* *(1≤s<sub>i</sub>≤10)*. Гарантируется, что будет введено не более *20* строк.

**Выходные данные**

Выведите номер первого некорректного слова. Гарантируется, что такое слово существует.

**Пример**

| **Входные данные** |
|--------------------|
| Kek                |
| Lol                |
| 31137              |
| fef                |

| **Выходные данные** |
|---------------------|
| 3                   |


Все тесты пройдены, задача сдана:
```py
cnt = 0
while True:
    s = input()
    cnt += 1
    if not s.isalpha():
        break

print(cnt)
```
