# Анаграммы

<p align="center">
<b>Анаграммы</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

Всем известно, что Василий обожает словесные игры. Недавно он основал новый клуб любителей анаграмм.

Напомним, что две строки называются анаграммами, если одну можно получить из другой перестановкой букв. Например, слова «кот», «ток» и «отк» являются анаграммами друг друга.

Василий составил список из *n* различных слов и теперь хочет выбрать из него как можно больше слов, так чтобы любые два выбранных слова были анаграммами друг друга. Помогите ему найти размер максимального возможного множества.

**Входные данные**

В первой строке содержится число *n* *(1≤n≤100)* — количество слов в списке Василия.

В следующих *n* строках содержатся слова, по одному в строке. Каждое слово состоит из строчных латинских букв. Длина каждого слова не превышает *100* символов. Все слова различны.

**Выходные данные**

Выведите одно целое число — размер максимального множества слов, в котором любые два слова являются анаграммами друг друга.

**Пример**

| **Входные данные** |
|--------------------|
| 5                  |
| cat                |
| dog                |
| act                |
| tac                |
| god                |

| **Выходные данные** |
|---------------------|
| 3                   |

| **Входные данные** |
|--------------------|
| 3                  |
| abcd               |
| efgh               |
| ijkl               |

| **Выходные данные** |
|---------------------|
| 1                   |


**Примечание**

В первом примере можно выбрать слова «cat», «act» и «tac», которые являются анаграммами друг друга.

Во втором примере нет пар анаграмм, поэтому максимальный размер множества равен *1*.

Все тесты пройдены, задача сдана:
```py
n = int(input())
anagram_counts = dict()
for _ in range(n):
    word = input()
    key = ''.join(sorted(word))
    anagram_counts[key] = anagram_counts.get(key, 0) + 1

print(max(anagram_counts.values()))
```
