# Морской псевдобой

<p align="center">
<b>Морской псевдобой</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

Напишите функцию, которая проверяет корректность индекса. Она должна возвращать логическое значение — верно ли, что принятый аргумент является корректным индексом для данного списка. После этого решите задачу.

Дано поле *1×n*, на каждой клетке которого стоит ровно одни кораблик. Коля совершает ходы *b1,b2,…,bn*. Смысл хода в следующем: если он выбрал число от *1* до *n*, то он стреляет в клетку с этим номером и уничтожает все кораблики там (если они были). Иначе, он ничего не делает.

Скажите, сколько корабликов он в итоге подобьет. 

**Входные данные**

В первой строке вводится число *n* — количество полей на поле *(1≤n≤30)*.

Во второй строке вводятся числа *b1,b2,…,bn* — ходы Коли *(−100≤b<sub>i</sub>≤100)*.

**Выходные данные**

Выведите целое число — сколько корабликов он подобьет.

**Пример**

| **Входные данные** |
|--------------------|
| 3                  |
| 1 2 -1             |

| **Выходные данные** |
|---------------------|
| 2                   |


Все тесты пройдены, задача сдана:
```py
def is_valid_index(lst, index):
    return 0 <= index < len(lst)

n = int(input())
b = list(map(int, input().split()))
ships = [1] * n
destroyed_count = 0
for move in b:
    index = move - 1
    if is_valid_index(ships, index):
        if ships[index] == 1:
            ships[index] = 0
            destroyed_count += 1

print(destroyed_count)
```
