# Изменения в массиве

<p align="center">
<b>Изменения в массиве</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

Вам вводится массив *a1,a2,…,an*, затем вводятся *q* запросов.

Каждый запрос описывает изменение массива: вводится число *k*. По данному *k* следует вычесть из каждого числа исходного массива целую часть от деления этого числа на *k*, затем вывести полученный массив. При этом между запросами массив не накапливает изменения, то каждое следующее изменение применяется к исходному массиву *a1,a2,…,an*. 

**Входные данные**

В первой строке вводятся числа *a1,a2,…,an* *(1≤n≤10,1≤a<sub>i</sub>≤1000)*.

Во второй строке вводится число *q* *(1≤q≤10)*.

В следующих *q* строках вводятся числа *k* для каджого запроса *(1≤k≤1000)*.

**Выходные данные**

Для каждого запроса выведите измененный массив.

**Пример**

| **Входные данные** |
|--------------------|
| 2 6 9              |
| 2                  |
| 2                  |
| 3                  |

| **Выходные данные** |
|---------------------|
| 1 3 5               |
| 2 4 6               |


Все тесты пройдены, задача сдана:
```py
a = list(map(int, input().split()))
q = int(input())
a_new = []
for i in range(q):
    k = int(input())
    for j in a:
        a_new.append(j - j // k)
    
    print(*a_new)
    a_new.clear()
```
