# Заборчик

<p align="center">
<b>Заборчик</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

Федя на лето уехал к бабушке в деревню. В один летний день Феде стало очень скучно и он решил выйти на улицу, чтобы найти что-нибудь, что может развеять его скуку. Его внимание привлек забор, построенный перед участком.

Он долго смотрел на доски, из которых был собран этот забор и, чтобы развлечь себя, решил посчитать количество досок, которые выше соседних.

Федя довольно быстро справился с этой задачей, поэтому он решил ее усложнить и запрограммировать! Сейчас он хочет найти количество досок выше соседних на разных подотрезках забора.

**Входные данные**

В первой строке дано целое число *n* *(1≤n≤50)*.

В следующей строке через пробел записаны высоты досок в заборе  — целые числа *a<sub>i</sub>* *(1≤a<sub>i</sub>≤100)*.

В третьей строке дано целое число *q* *(1≤q≤50)*  — число запросов.

В последующих *q* строках записаны сами запросы. Запрос представляет собой пару чисел *l,r* *(1≤l,r≤n)*  — левую и правую границы отрезка соответственно.

**Выходные данные**

На каждый запрос *l,r* выведите ответ  — количество досок выше своих соседей на подотрезке забора с доски с номером *l* по доску с номером *r*.

**Пример**

| **Входные данные** |
|--------------------|
| 5                  |
| 1 2 1 3 1          |
| 5                  |
| 1 3                |
| 1 2                |
| 1 5                |
| 2 4                |
| 2 5                |

| **Выходные данные** |
|---------------------|
| 1                   |
| 0                   |
| 2                   |
| 0                   |
| 1                   |


Все тесты пройдены, задача сдана:
```py
n = int(input())
a = list(map(int, input().split()))
q = int(input())
for _ in range(q):
    l, r = map(int, input().split())
    cnt = 0
    for i in range(l + 1, r):
        if a[i - 2] < a[i - 1] and a[i - 1] > a[i]:
                cnt += 1
            
    print(cnt)
```
