# Функциональное поле экспериментов

Пока Вася тренировал в команде свои хиловатые скиллы по `HTML, CSS, JavaScript` (а куда ж, ему деваться, поскольку он прочитал, что именно эти навыки нужны на рынке труда в первую очередь), ему пришлось отрабатывать дальше свой хлеб в этой крутой конторе. Пока он работал, начал постепенно понимать, что работа у него начала получаться и она начала ему нравиться.

Васе уже начали доверять работу с "боевыми" большими данными с HH и в новой задаче из отдела кадров, ему поступил следующий запрос - выводить на экран данные по вакансиям из CSV-файла HH с русскими подписями полей (см. Формат вывода).

Чтобы решить эту задачу ему требуется заменить названия полей на русскоязычные и заменить значения `"True" "False"` в CSV на аналогичные `"Да" "Нет"`.

Для помощи себе он составил словарик со следующими данными, которые он прочитал в [документации API HH](https://github.com/hhru/api/blob/master/docs/vacancies.md).

```
name: Название
description: Описание
key_skills: Навыки
experience_id: Опыт работы
premium: Премиум-вакансия
employer_name: Компания
salary_from: Нижняя граница вилки оклада
salary_to: Верхняя граница вилки оклада
salary_gross: Оклад указан до вычета налогов
salary_currency: Идентификатор валюты оклада
area_name: Название региона
published_at: Дата и время публикации вакансии
```

Василий дал себе обещание дальше писать только качественный код. Для этого, он в своем решении выделил следующие функции:
- `сsv_reader(file_name)`, получает название CSV-файла для обработки, возвращает список заголовков полей CSV и список данных о каждой вакансии
- `print_vacancies(vacancies, titles)` выписывает данные о вакансиях с переводом заголовков и значений True/False


**Формат ввода**

На вход будет подаваться название csv-файла. В csv-файле используется следующая структура:

```
name,description,key_skills,experience_id,premium,employer_name,salary_from,salary_to,salary_gross,salary_currency,area_name,published_at
Оперативный дежурный (инженер) ситуационного центра,"Обязанности:  мониторинг теле- и радиовещания мониторинг интернет-сайтов, электронной почты работа с массивами данных (сбор, обработка и системный анализ) подготовка справок, докладов, отчетов и презентаций контроль маршрутов перемещения автотранспорта контроль состояния датчиков охранной и пожарной сигнализации оперативное оповещение и информирование  Требования:  высшее образование в сфере связи опыт работы не менее 3 лет знание основ построения сетей связи владение ПК на уровне опытного пользователя (пакет Ms.Office) высокий уровень навыков работы с оргтехникой и средствами связи  Условия:  сменный график работы (сутки через двое) оформление в строгом соответствии с ТК РФ ежемесячные выплаты к должностному окладу  добровольное медицинское страхование дополнительные оплачиваемые выходные дни (5 к/дней в году) материальная помощь к ежегодному отпуску иные гарантии и компенсации в соответствии с коллективным договором ","MS Word
MS Excel
MS Visio
MS Internet Explorer
MS Outlook
Исполнительность
Внимательность
Ответственность
Дисциплинированность
Обучаемость
Способность быстро принимать решения",between3And6,False,"ГРЧЦ, ФГУП",48300.0,48300.0,True,RUR,Санкт-Петербург,11:44:58 14/06/2022
```

[Скачать пример файла](example.zip)

**Формат вывода**

```
Название: Оперативный дежурный (инженер) ситуационного центра
Описание: Обязанности:  мониторинг теле- и радиовещания мониторинг интернет-сайтов, электронной почты работа с массивами данных (сбор, обработка и системный анализ) подготовка справок, докладов, отчетов и презентаций контроль маршрутов перемещения автотранспорта контроль состояния датчиков охранной и пожарной сигнализации оперативное оповещение и информирование  Требования:  высшее образование в сфере связи опыт работы не менее 3 лет знание основ построения сетей связи владение ПК на уровне опытного пользователя (пакет Ms.Office) высокий уровень навыков работы с оргтехникой и средствами связи  Условия:  сменный график работы (сутки через двое) оформление в строгом соответствии с ТК РФ ежемесячные выплаты к должностному окладу  добровольное медицинское страхование дополнительные оплачиваемые выходные дни (5 к/дней в году) материальная помощь к ежегодному отпуску иные гарантии и компенсации в соответствии с коллективным договором
Навыки: MS Word, MS Excel, MS Visio, MS Internet Explorer, MS Outlook, Исполнительность, Внимательность, Ответственность, Дисциплинированность, Обучаемость, Способность быстро принимать решения
Опыт работы: between3And6
Премиум-вакансия: Нет
Компания: ГРЧЦ, ФГУП
Нижняя граница вилки оклада: 48300.0
Верхняя граница вилки оклада: 48300.0
Оклад указан до вычета налогов: Да
Идентификатор валюты оклада: RUR
Название региона: Санкт-Петербург
Дата и время публикации вакансии: 11:44:58 14/06/2022
```

P.S. Между вакансиями должна быть пустая строка. На концах строк не должно быть лишних пробелов

|                         |               |
|:------------------------|:--------------|
| **Ограничение времени** | **1 секунда** |
| **Ограничение памяти**  | **64.0 Мб**   |


Все тесты пройдены, задача сдана:
```py
import csv

dictionary = {
    "name": "Название",
    "description": "Описание",
    "key_skills": "Навыки",
    "experience_id": "Опыт работы",
    "premium": "Премиум-вакансия",
    "employer_name": "Компания",
    "salary_from": "Нижняя граница вилки оклада",
    "salary_to": "Верхняя граница вилки оклада",
    "salary_gross": "Оклад указан до вычета налогов",
    "salary_currency": "Идентификатор валюты оклада",
    "area_name": "Название региона",
    "published_at": "Дата и время публикации вакансии"
}

def сsv_reader(file_name):
    titles = []
    vacancies = []
    with open(file_name, encoding='utf_8_sig') as csv_file:
        reader = csv.reader(csv_file)
        titles = next(reader)
        for row in reader:
            vacancies += [row]
    return (vacancies, titles)

def print_vacancies(vacancies, titles):
    for vacancy in vacancies:
        for (title, info) in zip(titles, vacancy):
            print(f"{dictionary[title]}: {format_info(info)}")

        if vacancy != vacancies[-1]:
            print()

def format_info(info):
    result = info.rstrip()
    if info.count('\n'):
        result = ', '.join(info.split('\n'))
    elif info in ("True", "False"):
        result = "Да" if info == "True" else "Нет"
    return result

vacancies, titles = сsv_reader(input())
print_vacancies(vacancies, titles)
```
