# Слово "Я"

<p align="center">
<b>Слово "Я"</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

Вам будет дано предложение, записаное в одной строке. Ваша задача — вывести количество слов в этом предложении, равные «I».

**Входные данные**

В единственной строке вводится предложение *s*, состоящее исключительно из латинских букв и пробелов. Длина *s* не превосходит *100*.

**Выходные данные**

Выведите единственное целое число — количество слов «I» в *s*.

**Пример**

| **Входные данные** |
|--------------------|
| I am I             |

| **Выходные данные** |
|---------------------|
| 2                   |


Все тесты пройдены, задача сдана:
```py
s = input().split()
cnt = 0
for i in range(len(s)):
    if s[i] == 'I':
        cnt += 1

print(cnt)
```
