# Нечетные позиции

<p align="center">
<b>Нечетные позиции</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

Дана строка *s*. Посчитайте количество заглавных латинских букв «T» на нечетных позициях.

**Входные данные**

В единственной строке вводится слово *s* из заглавных латинских букв. Длина *s* не превосходит *50*.

**Выходные данные**

Выведите количество заглавных латинских букв «T» на нечетных позициях

**Пример**

| **Входные данные** |
|--------------------|
| TOKENTT            |

| **Выходные данные** |
|---------------------|
| 2                   |


Все тесты пройдены, задача сдана:
```py
s = input()
cnt = 0
for i in range(0, len(s), 2):
    if s[i] == 'T':
        cnt += 1

print(cnt)
```
