# Теорема Пифагора

<p align="center">
<b>Теорема Пифагора</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

Саша сидел на уроке математики и скучал. Учительница рассказывала какую-то теорему по геометрии, но Саша думал о другом. У него есть любимое число *C*, и ему стало интересно, существует ли два целых числа *a* и *b*, такие, что *a²+b²=C²*? Саша очень скоро устал возводить числа в квадрат, так что он попросил вас помочь ему.

**Входные данные**

В единственной строке вводится целое положительное число *C*, *1≤C≤1000*

**Выходные данные**

Если такие числа существуют, выведите «YES», иначе, выведите «NO»(без кавычек). Сами числа *a* и *b* выводить не нужно.

**Пример**

| **Входные данные** |
|--------------------|
| 11                 |

| **Выходные данные** |
|---------------------|
| NO                  |

| **Входные данные** |
|--------------------|
| 10                 |

| **Выходные данные** |
|---------------------|
| YES                 |


Все тесты пройдены, задача сдана:
```py
c = int(input())
ans = "NO"
for a in range(c):
    for b in range(c):
        if a*a + b*b == c*c:
            ans = "YES"
            break

print(ans)
```
