# Количество счастливых чисел

<p align="center">
<b>Количество счастливых чисел</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

У Васи есть последовательность *a1,a2,…,an*. Ему кажутся счастливыми числа, которые делятся на семь.

У Васи появилась просьба: посчитайте количество счастливых чисел в данном массиве. 

**Входные данные**

В единственной строке вводятся числа *a1,a2,…,an* *(1≤n≤10, 1≤a<sub>i</sub>≤1000*).

**Выходные данные**

Выведите единственное целое число — количество счастливых чисел.

**Пример**

| **Входные данные** |
|--------------------|
| 7 5 14             |

| **Выходные данные** |
|---------------------|
| 2                   |


Все тесты пройдены, задача сдана:
```py
a = list(map(int, input().split()))
cnt = 0
for i in a:
    if i % 7 == 0:
        cnt += 1

print(cnt)
```
