# Строй

<p align="center">
<b>Строй</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

В строю стоят четыре солдата. Рост их слева направо *a1,a2,a3,a4*.

Назовем нестабильностью построения максимальную разность в росте между соседними солдатами. Например, нестабильность построения *2,4,3,1* равна двойке, потому что разность в росте между первым и вторым солдатом равна двум. Также в этом примере разность в росте между третьим и четвертым солдатом тоже равна двум.

Выведите нестабильность данного вам построения.

**Входные данные**

В четырех строках вводятся целые числа *a1,a2,a3,a4a* *(1≤a<sub>i</sub>≤100)*.

**Выходные данные**

Выведите единственное целое число — нестабильность данного построения.

**Пример**

| **Входные данные** |
|--------------------|
| 2                  |
| 4                  |
| 3                  |
| 1                  |

| **Выходные данные** |
|---------------------|
| 2                   |


Все тесты пройдены, задача сдана:
```py
a1 = int(input())
a_prev = a1
d = 0
for i in range(3):
    a_next = int(input())
    if abs(a_next - a_prev) > d:
        d = abs(a_next - a_prev)
    a_prev = a_next
        
print(d)
```
