# Ну хоть как-то

<p align="center">
<b>Ну хоть как-то</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

Вам дано число *n*. Верно ли, что оно делится хотя бы на одно из перечисленных чисел: *3*, *7*, *12*, *29*, *50*, *51*, *53*, *75*?

**Входные данные**

В единственной строке вводится число *x* *(1≤x≤500)*.

**Выходные данные**

Выведите «YES» или «NO» — ответ на задачу.

**Пример**

| **Входные данные** |
|--------------------|
| 6                  |

| **Выходные данные** |
|---------------------|
| YES                 |

| **Входные данные** |
|--------------------|
| 11                 |

| **Выходные данные** |
|---------------------|
| NO                  |


Все тесты пройдены, задача сдана:
```py
n = int(input())
ans = "NO"
for i in [3, 7, 12, 29, 50, 51, 53, 75]:
    if n % i == 0:
        ans = "YES"
        break

print(ans)
```
