# Имена супругов

<p align="center">
<b>Имена супругов</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

Вам предоставленны данные о семейном положении из переписи населения. Нужно по имени человека находить имя его супруга(и). Гарантируется, что у одного человека может быть не более одного супруга.

**Входные данные**

В первой строке дано целое положительное число *N* – количество записей *(1≤N≤1000)*. Далее в отдельных строках даются *N* записей вида 'Имя человека:имя супруга(и)'. Каждое имя состоит из одного слова, содержащего заглавные и строчные латинские буквы. Затем дано число *M* – число запросов *(1≤M≤1000)*. Затем в отдельных строках даются *M* запросов, содержащих имена в описаном выше формате.

**Выходные данные**

На каждый запрос выведите в отдельной строке имя супруга(и) указанного человека. Если данных о таком человеке нет, выведите «NO_DATA»(без кавычек).

**Пример**

| **Входные данные**                        |
|-------------------------------------------|
| 3                                         |
| Erich:Maria                               |
| BonnieElizabethParker:ClydeChestnutBarrow |
| Ruslan:Lyudmila                           |
| 4                                         |
| Maria                                     |
| Noname                                    |
| BonnieElizabethParker                     |
| Ruslan                                    |

| **Выходные данные** |
|---------------------|
| Erich               |
| NO_DATA             |
| ClydeChestnutBarrow |
| Lyudmila            |


Все тесты пройдены, задача сдана:
```py
n = int(input())
names = dict()
for _ in range(n):
    person, spouse = input().split(':')
    names[person] = spouse
    names[spouse] = person

m = int(input())
for _ in range(m):
    print(names.get(input(), "NO_DATA"))
```
