# Наибольшее отрицательное

<p align="center">
<b>Наибольшее отрицательное</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

Вам дан массив *a1,a2,…,an*. Выведите наибольшее отрицательное число в этом массиве. Если в массиве нет отрицательных чисел, выведите *−1*.

**Входные данные**

В единственной строке друг за другом вводятся числа *a1,a2,…,an* *(1≤n≤10, −100≤a<sub>i</sub>≤100)*.

**Выходные данные**

Выведите единственное целое число — наибольшее отрицательное число в массиве.

**Пример**

| **Входные данные** |
|--------------------|
| 2 -3 -1            |

| **Выходные данные** |
|---------------------|
| -1                  |


Все тесты пройдены, задача сдана:
```py
a = list(map(int, input().split()))
n = 1
for i in a:
    if i < 0 and (n == 1 or i > n):
        n = i
        
print(-abs(n))
```
