# Сказка

<p align="center">
<b>Сказка</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

Сказки иногда содержат очень мало слов в строке, из-за чего Дима обратился к вам с просьбой соединить все nn строк сказки в одну (не забывая о расставлении пробелов между словами).

**Входные данные**

В первой строке вводится целое число *n* — количество строк в сказке *(1≤n≤10)*.

В следующих *n* строках вводятся строки сказки: *s1,s2,…,sn* — текст из знаков препинания, латинских букв и пробелов. Каждая строка имеет длину не более десяти.

**Выходные данные**

Сложите все строки сказки в одну большую, и выведите ее. Не забудьте расставить пробелы, соединяя строки!

**Пример**

| **Входные данные** |
|--------------------|
| 3                  |
| Once               |
| upon a time...     |
| <Tale starts>      |

| **Выходные данные**               |
|-----------------------------------|
| Once upon a time... <Tale starts> |


Все тесты пройдены, задача сдана:
```py
n = int(input())
string = ''
for i in range(n):
    s = input()
    string += s + ' '

print(string)
```
