# Поиск внутри поиска

<p align="center">
<b>Поиск внутри поиска</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

Вам дано предложение, состоящее из нескольких слов, разделенных пробелами. Посчитайте количество слов, в которых заглавных букв больше, чем гласных букв любого регистра.

**Входные данные**

В единственной строке вводится предложение *s* длиной не больше *100*.

**Выходные данные**

Выведите единственное целое число — ответ на задачу.

**Пример**

| **Входные данные**   |
|----------------------|
| Hi what is going ON  |

| **Выходные данные** |
|---------------------|
| 1                   |


Все тесты пройдены, задача сдана:
```py
s = input().split()
cnt_words = 0
for i in s:
    cnt_v = 0
    cnt_u = 0
    for j in i:
        if j.isupper():
            cnt_u += 1
        if j.upper() in "AEIOUY":
            cnt_v += 1

    if cnt_u > cnt_v:
        cnt_words += 1

print(cnt_words)
```
