# Прибыль

<p align="center">
<b>Прибыль</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

У одного бизнесмена на протяжении *n* лет Берляндская налоговая фиксировала состояние банковского счета. Согласно её информации, его состояние было равно *c1,c2,…,cn* долларам в соответствующем году.

Налог в Берляндии рассчитывается исходя из прибыли на протяжении *n* лет. Прибыль в первый год всегда равна состоянию в этот год, а начиная со второго года она считается так: если состояние бизнесмена увеличилось за один год на *x* долларов, то *x* — прибыль за этот год, а если состояние не изменилось или уменьшилось, то прибыль за этот год равна нулю. Прибыль за все *n* лет равна сумме прибылей в каждом году.

Помогите налоговой! Посчитайте прибыль этого бизнесмена.

**Входные данные**

В единственной строке вводятся числа *c1,c2,…,cn* *(1≤n≤30, 1≤c<sub>i</sub>≤1000)*

**Выходные данные**

Выведите единственное целое число — ответ на задачу.

**Пример**

| **Входные данные** |
|--------------------|
| 3 5 2 7            |

| **Выходные данные** |
|---------------------|
| 10                  |


Все тесты пройдены, задача сдана:
```py
c = list(map(int, input().split()))
s = c[0]
for i in range(1, len(c)):
    if c[i-1] < c[i]:
        s += c[i] - c[i-1]

print(s)
```
