# Индекс максимального

<p align="center">
<b>Индекс максимального</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

Вам дан массив *a1,a2,…,an*. Выведите номер первого (слева) числа — наибольшего числа в массиве.

**Входные данные**

В единственной строке друг за другом вводятся числа *a1,a2,…,an* *(1≤n≤10, 1≤a<sub>i</sub>≤10)*.

**Выходные данные**

Выведите единственное целое число — номер первого максимума в массиве.

**Пример**

| **Входные данные** |
|--------------------|
| 1 2 4 3 4          |

| **Выходные данные** |
|---------------------|
| 3                   |


Все тесты пройдены, задача сдана:
```py
a = list(map(int, input().split()))
a_max = 0
i_max = 0
for i in range(len(a)):
    if a[i] > a_max:
        a_max = a[i]
        i_max = i + 1

print(i_max)
```
