# Хорошие строки

<p align="center">
<b>Хорошие строки</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

Назовем слово хорошим, если его первая и последняя буква совпадают.

Вам дано *n* строк: *s1,s2,…,sn*. Посчитайте количество хороших строк среди них.

**Входные данные**

В первой строке вводится целое число *n* *(1≤n≤10)*.

В следующих *n* строках вводятся слова *s1,s2,…,sn*, состоящие из строчных латинских букв. Длина каждого слова не превосходит *10*.

**Выходные данные**

Выведите единственное целое число — ответ на задачу.

**Пример**

| **Входные данные** |
|--------------------|
| 3                  |
| aba                |
| doctored           |
| steel              |

| **Выходные данные** |
|---------------------|
| 2                   |


Все тесты пройдены, задача сдана:
```py
n = int(input())
c = 0
for i in range(n):
    s = input()
    if s[0] == s[len(s) - 1]:
        c += 1
        
print(c)
```
