# Выборка

В этом упражнении вы потренируетесь в подключении к базе данных и использовании конструкции SELECT ... WHERE в запросах к ней.

Вам дана база данных с таблицей следующего вида:

| **id** | **name**                | **age** | **gender** | **weight** | **height** |
|:-------|:------------------------|:--------|:-----------|:-----------|:-----------|
| **1**  | **Федотов Руслан**      | **26**  | **male**   | **98**     | **1.92**   |
| **2**  | **Терентьев Александр** | **25**  | **male**   | **147**    | **1.68**   |
| **3**  | **Белова Ульяна**       | **18**  | **female** | **76**     | **1.54**   |
| **4**  | **Столяров Тимофей**    | **22**  | **male**   | **124**    | **2.08**   |

Вам необходимо выбрать из таблицы записи мужчин, чей рост выше 1.8 и вывести на экран их id и имя. Записи должны быть отсортированы по имени человека (поле name).

**Формат ввода**

На вход в первой строке подаётся название базы данных и название таблицы во второй

```
example_database
example_table
```

**Формат вывода**

```
4 Столяров Тимофей
1 Федотов Руслан
```

|                         |               |
|:------------------------|:--------------|
| **Ограничение времени** | **1 секунда** |
| **Ограничение памяти**  | **512.0 Мб**  |


Все тесты пройдены, задача сдана:
```py
import sqlite3

database = input()
table = input()

conn = sqlite3.connect(f"./{database}")

query = f"SELECT id, name FROM {table} WHERE gender LIKE 'male%' AND height > 1.8 ORDER BY name ASC"
cursor = conn.execute(query)

for row in cursor:
    id = row[0]
    name = row[1]
    print(f"{id} {name}")
```
