# Автобус дяди Васи

<p align="center">
<b>Автобус дяди Васи</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

Дядя Вася каждый день ездит на своём автобусе и развозит людей по городу. Вы, как постоянный пассажир, заинтересовались, сколько за день зарабатывает дядя Вася.

Автобус останавливается на *N* остановках. Стоимость проезда в городе составляет *K* рублей. На каждой остановке заходит *A<sub>i</sub>* человек. Посчитайте, сколько за день заработает дядя Вася.

**Входные данные**

В первой строке дано целое число *N* *(1≤N≤100)*. Во второй строке дано целое число *K* *(1≤K≤50)*. Далее в *N* строках даны целые числа *A<sub>i</sub>* *(0≤A<sub>i</sub>≤100)* – по одному в каждой строке.

**Выходные данные**

Выведите одно число – прибыль дяди Васи.

**Пример**

| **Входные данные** |
|--------------------|
| 3                  |
| 11                 |
| 2                  |
| 3                  |
| 1                  |

| **Выходные данные** |
|---------------------|
| 66                  |

| **Входные данные** |
|--------------------|
| 5                  |
| 20                 |
| 0                  |
| 0                  |
| 0                  |
| 0                  |
| 1                  |

| **Выходные данные** |
|---------------------|
| 28                  |


Все тесты пройдены, задача сдана:
```py
n = int(input())
k = int(input())
s = 0
for i in range(n):
    s += k*int(input())

print(s)
```
