# Физкультурник

<p align="center">
<b>Физкультурник</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

На уроке физкультуры учитель обращает внимание на «ямочки» — так он называет учеников, которые в строю меньше, чем их сосед слева. Все такие ямочки он посылает отжиматься.

Вам дан рост учеников в строю *h1,h2,…,hn* в некоторых условных единицах. Выведите, сколько «ямочек» в этом строю.

**Входные данные**

В единственной строке вводятся числа *h1,h2,…,hn* *(1≤n≤10, 1≤h<sub>i</sub>≤100)* — рост учеников слева направо.

**Выходные данные**

Выведите количество «ямочек».

**Пример**

| **Входные данные** |
|--------------------|
| 1 2 3 2 3 4        |

| **Выходные данные** |
|---------------------|
| 1                   |


Все тесты пройдены, задача сдана:
```py
h = list(map(int, input().split()))
cnt = 0
for i in range(1, len(h)):
    if h[i-1] > h[i]:
        cnt += 1

print(cnt)
```
