# Средний балл

В этом упражнении вы потренируетесь в запросах, связанных с объединением нескольких таблиц.

Вам дана база данных с двумя таблицами следующего вида:

| **id** | **name**                | **age** | **gender** | **weight** | **height** |
|:-------|:------------------------|:--------|:-----------|:-----------|:-----------|
| **1**  | **Федотов Руслан**      | **26**  | **male**   | **98**     | **1.92**   |
| **2**  | **Терентьев Александр** | **25**  | **male**   | **147**    | **1.68**   |
| **3**  | **Белова Ульяна**       | **18**  | **female** | **76**     | **1.54**   |

| **id** | **mark** |
|:-------|:---------|
| **1**  | **92**   |
| **1**  | **85**   |
| **1**  | **46**   |
| **1**  | **78**   |
| **2**  | **82**   |
| **2**  | **0**    |
| **2**  | **0**    |
| **2**  | **0**    |
| **3**  | **32**   |
| **3**  | **74**   |
| **3**  | **90**   |
| **3**  | **55**   |

Вам необходимо посчитать при помощи объединения этих двух таблиц средний балл каждого учащегося.

**Формат ввода**

На вход в первой строке подаётся название базы данных, название таблицы с записями о студентах во второй и название таблицы с баллами в третьей строке

```
example_database
example_table
example_marks_table
```

**Формат вывода**

Для каждого учащегося выведите его имя и стредний балл, округленный до целого, разделив их пробелами

```
Федотов Руслан 75.0
Терентьев Александр 21.0
Белова Ульяна 63.0
```

|                         |               |
|:------------------------|:--------------|
| **Ограничение времени** | **1 секунда** |
| **Ограничение памяти**  | **512.0 Мб**  |


Все тесты пройдены, задача сдана:
```py
import sqlite3

database = input()
table = input()
mark_table = input()

conn = sqlite3.connect(database)

query = f"""
    SELECT {table}.name, ROUND(AVG({mark_table}.mark), 0) AS average
    FROM {table}
    JOIN {mark_table} ON {table}.id = {mark_table}.id
    GROUP BY {table}.id
    ORDER BY {table}.id
"""

result = conn.execute(query).fetchall()

for row in result:
    print(f"{row[0]} {row[1]}")
```
