# Знакопеременная сумма

<p align="center">
<b>Знакопеременная сумма</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

Дан массив целых чисел *a* длины *n* и *q* запросов. Каждый запрос задаётся парой чисел *l,r*, где *1≤l≤r≤n*. Для каждого запроса необходимо вычислить **знакопеременную сумму** на отрезке *[l,r]*, которая определяется следующим образом:

*S(l,r)=a<sub>l</sub>−a<sub>l+1</sub>+a<sub>l+2</sub>−a<sub>l+3</sub>+⋯±a<sub>r</sub>*

То есть элементы на нечётных позициях относительно начала отрезка берутся с плюсом, а на чётных — с минусом.

**Входные данные**

Первая строка содержит целое число *n* — размер массива *(1≤n≤100)*.

Вторая строка содержит *n* целых чисел *a1,a2,…,an* — элементы массива *a* *(1≤a<sub>i</sub>≤100)*.

Третья строка содержит целое число *q* — количество запросов *(1≤q≤100)*.

Следующие *q* строк содержат по два целых числа *l* и *r* — границы отрезка для каждого запроса *(1≤l≤r≤n)*.

**Выходные данные**

Для каждого запроса выведите одно число — знакопеременную сумму на отрезке *[l,r]*.

**Пример**

| **Входные данные** |
|--------------------|
| 5                  |
| 1 2 3 5 6          |
| 4                  |
| 1 2                |
| 2 5                |
| 3 3                |
| 1 4                |

| **Выходные данные** |
|---------------------|
| -1                  |
| -2                  |
| 3                   |
| -3                  |


Все тесты пройдены, задача сдана:
```py
n = int(input())
a = list(map(int, input().split()))
q = int(input())
for _ in range(q):
    l, r = map(int, input().split())
    s = 0
    sign = 1
    for i in range(l - 1, r):
        s += sign * a[i]
        sign = -sign
            
    print(s)
```
