# Шифр Цезаря

<p align="center">
<b>Шифр Цезаря</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

Вам дана строка *s*. Замените каждый символ этой строки на следующий и выведите ее.

**Входные данные**

В единственной строке вводится *s* — строка из строчных букв латинского алфавита длиной не более *10*. Гарантируется, что *s* не содержит буквы «z».

**Выходные данные**

Выведите измененную строку.

**Пример**

| **Входные данные** |
|--------------------|
| acbhefwu           |

| **Выходные данные** |
|---------------------|
| bdcifgxv            |


Все тесты пройдены, задача сдана:
```py
s = input()
s_new = ''
for i in range(len(s)):
    s_new += chr((ord(s[i]) + 1))

print(s_new)
```
