# Интересная сумма

<p align="center">
<b>Интересная сумма</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

Вам даны *N* чисел и число *K*. Найдите сумму всех чисел по следующему правилу: числа, большие *K*, прибавляются без изменений, а числа, которые меньше либо равны *K*, перед прибавлением умножаются на *10*.

**Входные данные**

В первой строке дано целое положительное число *N*, во второй – число *K* *(1≤N,K≤1000)*.

Далее в отдельных строках записаны *N* целых положительных чисел, каждое не больше *1000*.

**Выходные данные**

Выведите ответ на задачу.

**Пример**

| **Входные данные** |
|--------------------|
| 3                  |
| 10                 |
| 3                  |
| 13                 |
| 5                  |

| **Выходные данные** |
|---------------------|
| 93                  |

| **Входные данные** |
|--------------------|
| 5                  |
| 1                  |
| 1                  |
| 1                  |
| 1                  |
| 2                  |
| 4                  |

| **Выходные данные** |
|---------------------|
| 36                  |


Все тесты пройдены, задача сдана:
```py
n = int(input())
k = int(input())
s = 0
for i in range(n):
    num = int(input())
    if num <= k:
        num *= 10
    s += num

print(s)
```
