# Печать числа

<center>
<b>Печать числа</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</center>

Это ваша первая задача!

Напишите программу, которая выведет на экран число 1000. Напоминаем, что для этого вам понадобится команда «print()».

**Пример**

| **Входные данные** |
|--------------------|
|                    |

| **Выходные данные** |
|---------------------|
| 1000                |

**Примечание**

Выше вы видите раздел с примером. В таблице есть пусте «входные данные» – вы можете пока что игнорировать эту информацию.

В «выходных данных» показано, что должна вывести ваша программа, чтобы её ответ был принят

Все тесты пройдены, задача сдана:
```python
def visualComputeColor(address):
	file = address
	flow = read_flow(file)
	img = computeImg(flow)	
	cv2.imshow(file, img)
	cv2.waitKey(0)
```

```py
def visualComputeColor(address):
	file = address
	flow = read_flow(file)
	img = computeImg(flow)	
	cv2.imshow(file, img)
	cv2.waitKey(0)
```
