# Группировка

В этом упражнении вы потренируетесь в запросах, связанных с группировкой.

Вам дана база данных с таблицей следующего вида:

| **id** | **name**                | **age** | **gender** | **weight** | **height** |
|:-------|:------------------------|:--------|:-----------|:-----------|:-----------|
| **1**  | **Федотов Руслан**      | **26**  | **male**   | **98**     | **1.92**   |
| **2**  | **Терентьев Александр** | **25**  | **male**   | **147**    | **1.68**   |
| **3**  | **Белова Ульяна**       | **18**  | **female** | **76**     | **1.54**   |
| **4**  | **Столяров Тимофей**    | **22**  | **male**   | **124**    | **2.08**   |

Вам необходимо посчитать при помощи аггрегирующих функций и функций группировки средний рост и суммарный вес, для для каждого пола (male, female).

**Формат ввода**

На вход в первой строке подаётся название базы данных и название таблицы во второй

```
example_database
example_table
```

**Формат вывода**

Для каждого пола выведите собственно пол, средний рост (с округлением до 2 цифр) и суммарный вес

```
male 1.89 369
female 1.54 76
```

|                         |               |
|:------------------------|:--------------|
| **Ограничение времени** | **1 секунда** |
| **Ограничение памяти**  | **512.0 Мб**  |


Все тесты пройдены, задача сдана:
```py
import sqlite3

database = input()
table = input()

conn = sqlite3.connect(f"./{database}")

query = f"""
    SELECT gender, ROUND(AVG(height), 2), SUM(weight)
    FROM {table}
    GROUP BY gender
"""
result = conn.execute(query).fetchall()

for row in result:
    gender = row[0]
    avg_height = row[1]
    total_weight = row[2]
    print(f"{gender} {avg_height} {total_weight}")
```
