# Вася и счет

<p align="center">
<b>Вася и счет</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

У Васи сейчас *k* рублей в некотором Берляндском банке на счету. Банк, используя Васины деньги, поощряет его, добавляя на этот счет ежегодно некоторую сумму. Если у Васи меньше тысячи рублей, то банк в этот год начисляет ему два рубля. Иначе, он начисляет Васе целую часть от деления лежащей на счету суммы на пятьсот. Эта сумма кладется на тот же счет, где и лежали *k* рублей.

Вася забыл про этот счет и никак его не пополнял и деньги не снимал. Таким образом, он очень долго лежал в банке, и на него приходила сумма от банка.

Посчитайте, через сколько лет у Васи будет не меньше *a* рублей. 

**Входные данные**

В первой строке вводится целое число *k* *(1≤k≤5000)*.

Во второй строке вводится целое число *a* *(1≤a≤5000)*.

Гарантируется, что *a>k*.

**Выходные данные**

Выведите единственное целое число — ответ на задачу.

**Пример**

| **Входные данные** |
|--------------------|
| 5                  |
| 9                  |

| **Выходные данные** |
|---------------------|
| 2                   |

| **Входные данные** |
|--------------------|
| 2000               |
| 2100               |

| **Выходные данные** |
|---------------------|
| 25                  |


Все тесты пройдены, задача сдана:
```py
k = int(input())
a = int(input())
years = 0
while k < a:
    if k < 1000:
        k += 2
    else:
        k += k // 500
        
    years += 1

print(years)
```
