# Большое или маленькое?

<p align="center">
<b>Большое или маленькое?</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

Вам дана строка *s*, состоящая исключительно из латинских букв.

Проверьте, каких букв в ней больше: заглавных или строчных.

**Входные данные**

В единственной строке вводится текст *s*, состоящий из не более чем *10* символов.

**Выходные данные**

Выведите «BIG», в *s* количество заглавных букв строго больше, чем строчных. Если заглавных букв столько же, сколько и строчных, выведите «SAME». Иначе, выведите «SMALL»

**Пример**

| **Входные данные** |
|--------------------|
| sSSaa              |

| **Выходные данные** |
|---------------------|
| SMALL               |

| **Входные данные** |
|--------------------|
| TttTT              |

| **Выходные данные** |
|---------------------|
| BIG                 |

| **Входные данные** |
|--------------------|
| aB                 |

| **Выходные данные** |
|---------------------|
| SAME                |


Все тесты пройдены, задача сдана:
```py
s = input()
l = 0
u = 0
for i in range(len(s)):
    if s[i].islower():
        l += 1
    else:
        u += 1

if l < u:
    print("BIG")
elif l > u:
    print("SMALL")
else:
    print("SAME")
```
