# Процесс

<p align="center">
<b>Процесс</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

Пусть у вас есть счетчик *k=0*.

Давайте проделаем следующий процесс. Вам даны числа *a* и *b*. Пока *a<b* число *a* будем увеличивать в два раза, каждый раз прибавляя по единице к счетчику *k*. Тогда, как только *a≥b*, процесс завершится, а счетчик покажет, сколько раз *a* было вдвое увеличено до того, как оно стало не меньше *b*.

Реализуйте такой процесс на Python при помощи цикла *while*.

**Входные данные**

В двух строках заданы числа *a* и *b* *(1≤a,b≤300)*.

**Выходные данные**

Выведите счетчик *k* — сколько раз число aa увеличилось вдвое.

**Пример**

| **Входные данные** |
|--------------------|
| 2                  |
| 7                  |

| **Выходные данные** |
|---------------------|
| 2                   |


Все тесты пройдены, задача сдана:
```py
a = int(input())
b = int(input())
k = 0
while a < b:
    a *= 2
    k += 1
    
print(k)
```
