# Разворот

<p align="center">
<b>Разворот</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

Дан массив *a1,a2,…,an*. Разверните его.

**Входные данные**

В первой строке вводится число *n* — размер массива *(1≤n≤10)*.

В следующих *n* строках вводятся элементы массива *a1,a2,…an* по одному в строке *(1≤a<sub>i</sub>≤10)*.

**Выходные данные**

Выведите *n* чисел — развернутый массив *a1,a2,…,an*.

**Пример**

| **Входные данные** |
|--------------------|
| 3                  |
| 1                  |
| 2                  |
| 3                  |

| **Выходные данные** |
|---------------------|
| 3 2 1               |


Все тесты пройдены, задача сдана:
```py
n = int(input())
A = []
for a in range(n):
    A.append(int(input()))

A.reverse()
print(*A)
```
