# Партии

<p align="center">
<b>Партии</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

Вася играет в игру.

У Васи сейчас *n* очков. За каждую партию он может получить довольно странное число очков: *(n % k) + 1*, где *k* — некоторое постоянное значение.

Вам дано *n*, *k* и число *a*. Вася спрашивает, через сколько партий у него будет не меньше *a* очков?

**Входные данные**

В трех строках заданы числа *n*, *k* и *a* *(1≤n≤a≤100, 1≤k≤100)*.

**Выходные данные**

Выведите единственное целое число — через сколько партий у Васи станет не меньше aa очков.

**Пример**

| **Входные данные** |
|--------------------|
| 5                  |
| 3                  |
| 20                 |

| **Выходные данные** |
|---------------------|
| 5                   |


Все тесты пройдены, задача сдана:
```py
n = int(input())
k = int(input())
a = int(input())
cnt = 0
while n < a:
    n += (n % k) + 1
    cnt += 1

print(cnt)
```
