# О числе

<p align="center">
<b>О числе</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

Вам дано число *n*. Можно доказать, что несколько раз приписав единичку к нему в конце, оно рано или поздно поделится на *9*.

Сообщите, какое наименьшее число единиц надо приписать к *n*, чтобы оно поделилось на *9*. 

**Входные данные**

В единственной строке вводится число *n* *(1≤n≤10)*.

**Выходные данные**

Выведите единственное целое число — ответ на задачу.

**Пример**

| **Входные данные** |
|--------------------|
| 8                  |

| **Выходные данные** |
|---------------------|
| 1                   |


Все тесты пройдены, задача сдана:
```py
n = int(input())
cnt = 0
while n % 9 != 0:
    n = int(str(n) + '1')
    cnt += 1
    
print(cnt)
```
