# Интересное изменение

<p align="center">
<b>Интересное изменение</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

Вася нашел в кармане массив *a1,a2,…,an*. Ему стало интересно его поизменять.

Он нашел другой массив *b1,b2,…,bm* и решил, что для каждого элемента из массива *b* по очереди он сделает следующую операцию с массивом *a*:
- Если очередной элемент из *b* встречается в *a*, то необходимо удалить первое вхождение такого элемента из *a*.
- Иначе, в конец списка *a* нужно добавить очередной элемент из *b*. 

Скажите, как будет выглядеть массив aa после этих операций.

**Входные данные**

В первой строке вводятся числа *n* и *m* — размеры массивов *(1≤n,m≤20)*.

В следующей строке вводятся числа *a1,a2,…,an* *(1≤a<sub>i</sub>≤20)*.

В последней строке вводятся числа *b1,b2,…,bn* *(1≤b<sub>i</sub>≤20)*.

**Выходные данные**

Выведите массив после проделанных операций.

**Пример**

| **Входные данные** |
|--------------------|
| 6 2                |
| 4 1 4 2 1 4        |
| 4 2                |

| **Выходные данные** |
|---------------------|
| 1 4 1 4             |


Все тесты пройдены, задача сдана:
```py
n, m = map(int, input().split())
A = list(map(int, input().split()))
B = list(map(int, input().split()))
for b in B:
    if b in A:
        A.pop(A.index(b, 0, len(A)))
    else:
        A.append(b)

print(*A)
```
