# Новый словарь

<p align="center">
<b>Новый словарь</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

Недавно вы обнаружили два древних словаря. В первом словаре содержатся переводы с языка *A* на язык *B*, а во втором — переводы с языка *B* на язык *C*. Вы решили создать новый словарь для перевода с языка *A* на язык *C*, используя имеющиеся данные. Для этого вам будут поступать запросы на перевод слов с языка *A*. Ваша задача — для каждого запроса вывести перевод слова на язык *C* или указать, что перевод невозможен.

**Входные данные**

В первой строке вводится целое число *n* — количество пар переводов в словаре из языка *A* в язык *B* *(1≤n≤10⁴)*.

В следующих *n* строках вводятся пары слов, разделённых пробелом. Первое слово в паре принадлежит языку *A*, а второе – языку *B*. Гарантируется, что у каждого слова существует только один перевод и нет двух слов, которые переводятся одинаково.

В следующей строке вводится целое число *m* — количество пар переводов в словаре из языка *B* в язык *C* *(1≤m≤10⁴)*.

В следующих *m* строках вводятся пары слов, разделённых пробелом. Первое слово в паре принадлежит языку *B*, а второе — языку *C*. Гарантируется, что у каждого слова существует только один перевод и нет двух слов, которые переводятся одинаково.

В следующей строке вводится целое число *q* — количество запросов на перевод с языка *A* на язык *C* *(1≤q≤10⁴)*.

В следующих *q* строках вводятся слова из языка *A*, для которых требуется найти перевод на язык *C*.

Гарантируется, что все введённые слова имеют длину до *20*.

**Выходные данные**

Для каждого запроса выведите в отдельной строке перевод слова с языка *A* на язык *C*. Если перевод невозможен, выведите *-1*.

**Пример**

| **Входные данные** |
|--------------------|
| 3                  |
| apple pomme        |
| banana banane      |
| orange orange      |
| 3                  |
| pomme apfel        |
| orange orange      |
| poire birne        |
| 6                  |
| apple              |
| banana             |
| orange             |
| apfel              |
| poire              |
| ulearn             |

| **Выходные данные** |
|---------------------|
| apfel               |
| -1                  |
| orange              |
| -1                  |
| -1                  |
| -1                  |


Все тесты пройдены, задача сдана:
```py
def get_dict(count):
    return dict(input().split() for _ in range(count))

ab_dictionary = get_dict(int(input()))
bc_dictionary = get_dict(int(input()))

q = int(input())
for _ in range(q):
    word = input()
    print(bc_dictionary.get(ab_dictionary.get(word, ""), -1))
```
