# Наименьшее нечетное

<p align="center">
<b>Наименьшее нечетное</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

Вам дан массив *a1,a2,…,an*. Выведите наименьшее нечетное число в массиве. Если такого числа в массиве нет, выведите *−1*.

Подсказка: прежде чем задавать значение по умолчанию для лучшего индекса, найдите в массиве любое нечетное число — это и будет значение для переменной с индексом по умолчанию.

**Входные данные**

В единственной строке друг за другом вводятся числа *a1,a2,…,an* *(1≤n≤10, 1≤a<sub>i</sub>≤10)*.

**Выходные данные**

Выведите единственное целое число — наименьшее нечетное число.

**Пример**

| **Входные данные** |
|--------------------|
| 2 1 3              |

| **Выходные данные** |
|---------------------|
| 1                   |


Все тесты пройдены, задача сдана:
```py
a = list(map(int, input().split()))
a_odd = -1
for i in a:
    if i % 2 != 0 and (a_odd == -1 or i < a_odd):
        a_odd = i

print(a_odd)
```
