# Две строки

<p align="center">
<b>Две строки</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

Даны строки *a* и *b* равной длины. Сообщите количество позиций, на которых у *a* и у *b* находится одинаковая буква.

**Входные данные**

В первой строке вводится строка *a*, а во второй — строка *b*. Строки состоят из строчных латинских букв и имеют равную длину, не превосходящую *50*.

**Выходные данные**

Выведите количество позиций, на которых у *a* и у *b* содержатся одинаковые буквы.

**Пример**

| **Входные данные** |
|--------------------|
| aba                |
| abc                |

| **Выходные данные** |
|---------------------|
| 2                   |


Все тесты пройдены, задача сдана:
```py
a = input()
b = input()
cnt = 0
for i in range(len(a)):
    if a[i] == b[i]:
        cnt += 1

print(cnt)
```
