# Некорректные данные

На третий день работы Васе надоело в отделе кадров, и он пошёл к начальнику просить перевода в отдел разработки. Его начальник, Александр Владиславович, открыл его программу для составления карточек и не читая инструкции стал вводить туда неправильные данные. Естественно программа сломалась (попробуйте сами). Васю похвалили за технический подход к решению рутинной задачи, но сказали, что в программе нужно закрыть дыры.

Допишите код из предыдущей задачи так, чтобы он не выдавал ошибок при некорректных данных:
- Название и описание не должны быть пустыми
- Числовые поля должны иметь возможность конвертироваться в int
- Bool поля должны принимать только `да` или `нет`
- Нижняя граница оклада должна быть не больше верхней границы оклада. Если это не так, то выводится фраза `Нижняя граница оклада должна быть не больше верхней границы. Повторите ввод`, и снова появляются поля для ввода нижней и верхней границы оклада.
- В случае если пользователь ввёл что-то неправильно, выводится фраза `Данные некорректны, повторите ввод`. И снова появляется поле для ввода, неправильно введённого свойства.


**Формат ввода**

```
Введите название вакансии: Программист
Введите описание вакансии: Хорошие знания C#, JavaScript(Опыт работы. Синтаксис. ООП)
Введите город для вакансии: Екатеринбург
Введите требуемый опыт работы (лет): 1
Введите нижнюю границу оклада вакансии: 40000
Введите верхнюю границу оклада вакансии: С#
Данные некорректны, повторите ввод
Введите верхнюю границу оклада вакансии: 350000
Нужен свободный график (да / нет): да
Является ли данная вакансия премиум-вакансией (да / нет): нет
```

**Формат вывода**

```
Программист
Описание: Хорошие знания C#, JavaScript(Опыт работы. Синтаксис. ООП)
Город: Екатеринбург
Требуемый опыт работы: 1 год
Средний оклад: 195000 рублей
Свободный график: да
Премиум-вакансия: нет
```

|                         |                       |
|:------------------------|:----------------------|
| **Ограничение времени** | **1 секунда**         |
| **Ограничение памяти**  | **64.0 Мб**           |
| **Ввод**                | **стандартный ввод**  |
| **Вывод**               | **стандартный вывод** |


Все тесты пройдены, задача сдана:
```py
import math

def CheckCorrectData(data, dataType):
    if isinstance(dataType, bool) and (data == 'да' or data == 'нет'):
        return True
    elif isinstance(dataType, int) and data.isdigit():
        return True
    elif isinstance(dataType, str) and data != '':
        return True
    else:
        return False

def InputData(textData, dataType):
    data = input(textData)
    while not CheckCorrectData(data, dataType):
        print('Данные некорректны, повторите ввод')
        data = input(textData)
    
    if isinstance(dataType, int) and data.isdigit():
        return int(data)
    elif isinstance(dataType, bool):
        return True if data == 'да' else False
    return data

def PerformDeclension(text, declensions):
    if text == 1:
        return declensions[0]
    elif text in (2, 3, 4):
        return declensions[1]
    else:
        return declensions[2]

jobName = InputData('Введите название вакансии: ', str())
jobDiscription = InputData('Введите описание вакансии: ', str())
city = InputData('Введите город для вакансии: ', str())
experience = InputData('Введите требуемый опыт работы (лет): ', int())
lowerSalaryLimit = InputData('Введите нижнюю границу оклада вакансии: ', int())
upperSalaryLimit = InputData('Введите верхнюю границу оклада вакансии: ', int())
while lowerSalaryLimit > upperSalaryLimit:
    print('Нижняя граница оклада должна быть не больше верхней границы. Повторите ввод.')
    lowerSalaryLimit = InputData('Введите нижнюю границу оклада вакансии: ', int())
    upperSalaryLimit = InputData('Введите верхнюю границу оклада вакансии: ', int())

isFlexible = InputData('Нужен свободный график (да / нет): ', bool())
isPremium = InputData('Является ли данная вакансия премиум-вакансией (да / нет): ', bool())

print(jobName)
print(f"Описание: {jobDiscription}")
print(f"Город: {city}")
print(f"Требуемый опыт работы: {experience} {PerformDeclension(experience, ['год','года','лет'])}")

roundedAvgSalary = math.floor((upperSalaryLimit+lowerSalaryLimit)/2)
print(f"Средний оклад: {roundedAvgSalary} {PerformDeclension(roundedAvgSalary, ['рубль','рубля','рублей'])}")
print(f"Свободный график: {'да' if isFlexible else 'нет'}")
print(f"Премиум-вакансия: {'да' if isPremium else 'нет'}")
```
