# Проверка на память

<p align="center">
<b>Проверка на память</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

Дима как-то купил себе массив *c1,c2,…,cn*, и, как уважающий себя человек, сразу же его развернул.

Мише не очень понравился такой массив, поэтому, чтобы потешиться, он решил поинтересоваться, а какие элементы стояли на позициях *d1,d2,…,dk* до разворота. И чтобы Дима не хитрил, он попросил его после всех этих вопросов вывести развернутый массив.

Диме сложно, ведь он не хитрит. А вы, может быть, схитрите. Помогите Диме ответить на вопросы Миши и вывести развернутый массив.

**Входные данные**

В первой строке друг за другом вводятся числа *c1,c2,…,cn* *(1≤n≤10, 1≤a<sub>i</sub>≤10)* — изначальный массив, до разворота.

Во второй строке вводится число *k* — количество вопросов Миши *(1≤k≤n)*.

В следующих *k* строках вводятся по одному числа *d1,d2,…,dk* *(1≤d<sub>i</sub>≤n)* — вопросы Миши про исходный массив *c*.

**Выходные данные**

В *k* строках выведите ответы на каждый вопрос Миши — элементы, находящиеся на спрашиваемых позициях.

Затем, в одной строке выведите развернутый массив.

**Пример**

| **Входные данные** |
|--------------------|
| 2 4 6 8 10         |
| 3                  |
| 4                  |
| 2                  |
| 1                  |

| **Выходные данные** |
|---------------------|
| 8                   |
| 4                   |
| 2                   |
| 10 8 6 4 2          |


Все тесты пройдены, задача сдана:
```py
a = list(map(int, input().split()))
k = int(input())
for i in range(k):
    print(a[int(input()) - 1])

print(*a[::-1])
```
