# Уникальные маршруты

<p align="center">
<b>Уникальные маршруты</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

Вова сидел на остановке и ждал автобус домой. От нечего делать он принялся записывать номера автобусов, проезжающих через остановку. Номера автобусов в городе Вовы представляют собой натуральные числа, не превосходящие *10000000*. Когда Вова, наконец, сел в свой автобус и поехал, ему стало интересно, автобусы каких маршрутов проехали через остановку всего один раз(назовём такие маршруты «уникальными»). Вова просит вас помочь ему найти ответ на этот вопрос. Номера маршрутов нужно вывести в порядке возрастания.

**Входные данные**

В первой строке дано целое положительное число *N* – количество автобусов, проехавших через остановку *(1≤N≤1000)*. Далее в отдельных строках даются *N* целых чисел – номер *A<sub>i</sub>* очередного автобуса *(1≤A<sub>i</sub>≤10000000)*.

**Выходные данные**

В первой строке выведите *M* – число уникальных маршрутов. Во второй строке выведите через пробел *M* чисел - номера уникальных маршрутов в порядке возрастания. Если таких маршрутов нет, выведите только число *0*.

**Пример**

| **Входные данные** |
|--------------------|
| 5                  |
| 2                  |
| 3                  |
| 2                  |
| 2                  |
| 1                  |

| **Выходные данные** |
|---------------------|
| 2                   |
| 1 3                 |


Все тесты пройдены, задача сдана:
```py
n = int(input())
routes = dict()
for _ in range(n):
    num = int(input())
    routes[num] = routes.get(num, 0) + 1

unique_routes = [route for route, count in routes.items() if count == 1]	
unique_routes.sort()	

print(len(unique_routes))
for route in unique_routes:
    print(route, end=' ')
```
