# Paint 2.0

<p align="center">
<b>Paint 2.0</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

Вы попали в команду разработки нового приложения *Paint 2.0*. Основное отличие *Paint 2.0* от младшей версии заключается в том, что *Paint 2.0* сохраняет все нарисованные слои, а ластик стирает только самый верхний слой.

Ваша задача написать функции, которые будут использоваться практически во всех местах этой программы: *set_pixel(x,y,c)*, *get_pixel(x,y)* и *erase_pixel(x,y)*.

*set_pixel* принимает на вход координаты пикселя *(x,y)* и цвет, в который нужно покрасить данный пиксель. Помните, что все предыдущие слои этого пикселя остаются.

*get_pixel* принимает на вход координаты пикселя *(x,y)* и возвращает цвет, в который покрашен этот пиксель. Если пиксель не закрашен нужно вывести *white* (по умолчанию цвет листа в *Paint 2.0* белый). Не забывайте, что нужно возвращать цвет самого верхнего слоя.

*erase_pixel* – функция, которую будет вызывать компонент «ластик». Принимает на вход координаты пикселя *(x,y)* и удаляет самый верхний слой.

Для тестирования этих функций вам предоставили скрипт, который производит несколько запросов к вашим функциям в определенном формате.

**Входные данные**

В первой строке на вход подается целое число *n*, *(1≤n≤1000)* – количество запросов к вашим функциям.

В следующих *n* строках заданы сами запросы в следующем формате: *querytype...args*. Где *querytype* – это один символ, обозначающий тип запроса. Для *set_pixel* это символ *s*, для *get_pixel* это символ *g*, для *erase_pixel* это *e*. Затем идут аргументы, соответствующие выбранной функции.

Координаты в данной задаче – целые числа *(−1000000≤x,y≤1000000)*. Цвета представлены строками длиной от *1* до *100* символов.

**Выходные данные**

На выходе ожидается список строк – ответы на запросы *get_pixel*. Каждый цвет должен находиться в отдельной строке.

**Пример**

| **Входные данные** |
|--------------------|
| 5                  |
| g 1 1              |
| s 1 1 fuxy         |
| g 1 1              |
| e 1 1              |
| g 1 1              |

| **Выходные данные** |
|---------------------|
| white               |
| fuxy                |
| white               |


Все тесты пройдены, задача сдана:
```py
def set_pixel(x, y, c):
    key = (x, y)
    if key not in pixels:
        pixels[key] = []
    pixels[key].append(c)


def get_pixel(x, y):
    key = (x, y)
    if key in pixels and pixels[key]:
        return pixels[key][-1]
    else:
        return "white"


def erase_pixel(x, y):
    key = (x, y)
    if key in pixels and pixels[key]:
        pixels[key].pop()
        if not pixels[key]:
            del pixels[key]


n = int(input())
pixels = dict()
results = []

for _ in range(n):
    query = input().split()
    query_type = query[0]
    x = int(query[1])
    y = int(query[2])
    if query_type == 's':
        set_pixel(x, y, query[3])
    elif query_type == 'g':
        results.append(get_pixel(x, y))
    elif query_type == 'e':
        erase_pixel(x, y)

for result in results:
    print(result)
```
