# Вова и камушки

<p align="center">
<b>Вова и камушки</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

У Вовы есть любимая кучка камней, в которой изначально лежит *a* камней. Он приходит к ней каждый день на протяжении *n* дней. Каждый день он удваивал количество камней в кучке, и выбрасывал *a<sub>i</sub>* камней, которые ему не нравились. Если *a<sub>i</sub>* больше количества камней в кучке, то Вова просто выбрасывал все камни и оставлял кучку пустой.

Узнайте сколько камней останется в кучке после *n* дней.

**Входные данные**

В первой строке дано целое положительное число *a* *(a≤10)*. Во второй строке – целое положительное число *n* *(n≤100)*. В следующих nn строках даны целые *a<sub>i</sub>* *(0≤a<sub>i</sub>≤100)* – по одному в строке.

**Выходные данные**

В единственной строке выведите количество камней в кучке.

**Пример**

| **Входные данные** |
|--------------------|
| 5                  |
| 3                  |
| 3                  |
| 4                  |
| 0                  |

| **Выходные данные** |
|---------------------|
| 20                  |

| **Входные данные** |
|--------------------|
| 1                  |
| 3                  |
| 1                  |
| 2                  |
| 3                  |

| **Выходные данные** |
|---------------------|
| 0                   |


Все тесты пройдены, задача сдана:
```py
a = int(input())
n = int(input())
for i in range(n):
    a *= 2
    a_i = int(input())
    if a > a_i:
        a -= a_i
    else:
        a = 0
    
print(a)
```
