# Печать по-русски

О боже! Внезапно Вася заметил, что в выводе его замечательной программки в отдельных полях регулярно встречаются непонятные аббревиатуры на английском языке. Так, например, в опыте работы записано `between1And3`, а в идентификаторе валюты оклада `RUR`. Смысл значений был примерно понятен, но скорее всего, есть какая-то более точная расшифровка этих значений, а, возможно, и каких-то других, какие Вася еще не успел еще заметить в этих полях. И он пошел снова читать [документацию по API HH](https://github.com/hhru/api/blob/master/docs/vacancies.md).

И тут он понял, что эти значения - это определенные значения из других справочников HH, которые он нашел на [другой странице документации](https://api.hh.ru/openapi/redoc#tag/Obshie-spravochniki/paths/~1dictionaries/get). Он понял, как эти значения расшифровываются и сделал для своей программки небольшие словарики для разбора этих данных, со значениями:

Опыт работы:

```
"noExperience": "Нет опыта
"between1And3": "От 1 года до 3 лет
"between3And6": "От 3 до 6 лет
"moreThan6": "Более 6 лет"
```

Валюта:

```
"AZN": "Манаты"
"BYR": "Белорусские рубли"
"EUR": "Евро"
"GEL": "Грузинский лари"
"KGS": "Киргизский сом"
"KZT": "Тенге"
"RUR": "Рубли"
"UAH": "Гривны"
"USD": "Доллары"
"UZS": "Узбекский сум"
```

Соответственно, Вася поставил перед собой задачу перевести и эти поля.

К тому же, Вася заметил, что поля с зарплатами занимают очень много строчек, и на самом деле их можно уместить в одну. Т.е. поля, содержащие salary, можно объединить в такую надпись: `salary_from - salary_to (salary_currency) (salary_gross)`

Умещать все преобразования в `print_vacancies` стало неудобно, поэтому Вася решил создать для этого функцию `formatter(row)`
- `def formatter(row)`, получает словарь сформированный из строки CSV-файла со стандартными значениями, возвращает новый словарь со всем необходимым форматированием и подстановками, предназначенным для печати. Эта функция используется в функции print_vacancies.

`Формат ввода не изменен`

**Формат ввода**

В csv-файле используется следующая структура:

```
name,description,key_skills,experience_id,premium,employer_name,salary_from,salary_to,salary_gross,salary_currency,area_name,published_at
Оперативный дежурный (инженер) ситуационного центра,"Обязанности:  мониторинг теле- и радиовещания мониторинг интернет-сайтов, электронной почты работа с массивами данных (сбор, обработка и системный анализ) подготовка справок, докладов, отчетов и презентаций контроль маршрутов перемещения автотранспорта контроль состояния датчиков охранной и пожарной сигнализации оперативное оповещение и информирование  Требования:  высшее образование в сфере связи опыт работы не менее 3 лет знание основ построения сетей связи владение ПК на уровне опытного пользователя (пакет Ms.Office) высокий уровень навыков работы с оргтехникой и средствами связи  Условия:  сменный график работы (сутки через двое) оформление в строгом соответствии с ТК РФ ежемесячные выплаты к должностному окладу  добровольное медицинское страхование дополнительные оплачиваемые выходные дни (5 к/дней в году) материальная помощь к ежегодному отпуску иные гарантии и компенсации в соответствии с коллективным договором","MS Word
MS Excel
MS Visio
MS Internet Explorer
MS Outlook
Исполнительность
Внимательность
Ответственность
Дисциплинированность
Обучаемость
Способность быстро принимать решения",between3And6,False,"ГРЧЦ, ФГУП",48300.0,48300.0,True,RUR,Санкт-Петербург,11:44:58 14/06/2022
```

[Скачать пример файла](example.zip)

**Формат вывода**

```
Название: Оперативный дежурный (инженер) ситуационного центра
Описание: Обязанности:  мониторинг теле- и радиовещания мониторинг интернет-сайтов, электронной почты работа с массивами данных (сбор, обработка и системный анализ) подготовка справок, докладов, отчетов и презентаций контроль маршрутов перемещения автотранспорта контроль состояния датчиков охранной и пожарной сигнализации оперативное оповещение и информирование  Требования:  высшее образование в сфере связи опыт работы не менее 3 лет знание основ построения сетей связи владение ПК на уровне опытного пользователя (пакет Ms.Office) высокий уровень навыков работы с оргтехникой и средствами связи  Условия:  сменный график работы (сутки через двое) оформление в строгом соответствии с ТК РФ ежемесячные выплаты к должностному окладу  добровольное медицинское страхование дополнительные оплачиваемые выходные дни (5 к/дней в году) материальная помощь к ежегодному отпуску иные гарантии и компенсации в соответствии с коллективным договором
Навыки: MS Word, MS Excel, MS Visio, MS Internet Explorer, MS Outlook, Исполнительность, Внимательность, Ответственность, Дисциплинированность, Обучаемость, Способность быстро принимать решения
Опыт работы: От 3 до 6 лет
Премиум-вакансия: Нет
Компания: ГРЧЦ, ФГУП
Оклад: 48 300 - 48 300 (Рубли) (Без вычета налогов)
Название региона: Санкт-Петербург
Дата публикации вакансии: 11:44:58 14/06/2022
```

|                         |               |
|:------------------------|:--------------|
| **Ограничение времени** | **1 секунда** |
| **Ограничение памяти**  | **64.0 Мб**   |


Все тесты пройдены, задача сдана:
```py
import csv

dictionary = {
    "name": "Название",
    "description": "Описание",
    "key_skills": "Навыки",
    "experience_id": "Опыт работы",
    "premium": "Премиум-вакансия",
    "employer_name": "Компания",
    "salary": "Оклад",
    "area_name": "Название региона",
    "published_at": "Дата публикации вакансии"
}

work_experience = {
    "noExperience": "Нет опыта",
    "between1And3": "От 1 года до 3 лет",
    "between3And6": "От 3 до 6 лет",
    "moreThan6": "Более 6 лет"
}

currency = {
    "AZN": "Манаты",
    "BYR": "Белорусские рубли",
    "EUR": "Евро",
    "GEL": "Грузинский лари",
    "KGS": "Киргизский сом",
    "KZT": "Тенге",
    "RUR": "Рубли",
    "UAH": "Гривны",
    "USD": "Доллары",
    "UZS": "Узбекский сум"
}

def сsv_reader(file_name):
    titles = []
    vacancies = []
    with open(file_name, encoding='utf_8_sig') as csv_file:
        reader = csv.reader(csv_file)
        titles = next(reader)
        for row in reader:
            vacancies += [row]
    return (vacancies, titles)

def print_vacancies(vacancies, titles):
    for vacancy in vacancies:
        row = {}
        for (title, info) in zip(titles, vacancy):
            row[title] = info

        for key, value in formatter(row).items():
            print(f"{dictionary[key]}: {value}")

        if vacancy != vacancies[-1]:
            print()

def formatter(row):
    result = {}

    for key, value in row.items():
        value = value.rstrip()

        match key:
            case 'key_skills':
                result[key] = ', '.join(value.split('\n'))
            case 'experience_id':
                result[key] = work_experience[value]
            case 'premium':
                result[key] = "Да" if value == "True" else "Нет"
            case 'salary_from' | 'salary_to':
                result[key] = '{0:,}'.format(int(float(value))).replace(',', ' ')
            case 'salary_gross':
                result[key] = "Без вычета налогов" if value == "True" else "С вычетом налогов"
            case 'salary_currency':
                result[key] = currency[value]
            case _:
                result[key] = value
    
    result['salary'] = f"{result.pop('salary_from')} - {result.pop('salary_to')} ({result.pop('salary_currency')}) ({result.pop('salary_gross')})"
    result['area_name'] = result.pop('area_name')
    result['published_at'] = result.pop('published_at')
    
    return result

vacancies, titles = сsv_reader(input())
print_vacancies(vacancies, titles)
```
