# Большая буква

<p align="center">
<b>Большая буква</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

Вам дана строка *s* и буква *t*. Найдите первую такую букву, которая не меньше буквы *t* (используйте для этого операторы сравнения). Выведите первую позицию, на которой эта буква встречается. Гарантируется, что такая буква есть в строке.

**Входные данные**

В первой строке вводится строка *s*, состоящая из заглавных латинских букв *(1≤∣s∣≤50)*.

Во второй строке вводится заглавная латинская буква *t*.

**Выходные данные**

Выведите единственное число — позицию, на которой стоит символ, не меньший символа *t*.

**Пример**

| **Входные данные** |
|--------------------|
| ANANAS             |
| B                  |

| **Выходные данные** |
|---------------------|
| 2                   |


Все тесты пройдены, задача сдана:
```py
s = input()
t = input()
for i in range(len(s)):
    if s[i] >= t:
        print(i + 1)
        break
```
