# Прямоугольник

<p align="center">
<b>Прямоугольник</b> <br>
ограничение по времени на тест:
1 секунда <br>
ограничение по памяти на тест:
256 мегабайт <br>
ввод:
стандартный ввод <br>
вывод:
стандартный вывод <br>
</p>

Даны два целых числа *a* и *b*, а так же символ *s*. Выводом программы нарисуйте прямоугольник, заполненный символами *s* высотой *a* и шириной *b*.

**Входные данные**

Входные данные состоят из трех строк. В первых двух находятся целые числа *a* и *b* соответственно *(1≤a,b≤5)*. В третьей строке находится символ, которым нужно заполнить прямоугольник (подробнее в примерах).

Грантируется, что в третьей строке будет находиться ровно один символ.

**Выходные данные**

На выходе ожидается прямоугольник с высотой *a* и шириной *b*, заполненный символами *s*.

**Пример**

| **Входные данные** |
|--------------------|
| 3                  |
| 2                  |
| *                  |

| **Выходные данные** |
|---------------------|
| **                  |
| **                  |
| **                  |

| **Входные данные** |
|--------------------|
| 2                  |
| 3                  |
| 0                  |

| **Выходные данные** |
|---------------------|
| 000                 |
| 000                 |

**Примечание**

Для того, чтобы получить символ из ввода, можно воспользоваться конструкцией

*s=input()*

Все тесты пройдены, задача сдана:
```py
a = int(input())
b = int(input())
s = input()
for i in range(a):
    for j in range(b):
        print(s, end='', sep='')
    print()
```
